[
  {
    "Title": "IKEA Offers Free Wall Anchoring Repair Kit for Chests and Dressers Due to Tip-over Hazard After Two Children Died",
    "Date": "7/22/2015",
    "Summary": "WASHINGTON, D.C. - The U.S. Consumer Product Safety Commission   (CPSC), in cooperation with IKEA North America, of Conshohocken, Pa, is   announcing a repair program that includes a free wall anchoring kit,  for  their MALM 3- and 4-drawer chests and two styles of MALM 6- drawer   chests, and other chests and dressers.  The chests and dressers can  pose  a tip-over hazard if not securely anchored to the wall.     IKEA received reports of two children who died after MALM chests   tipped over and fell on them.  Consumers should immediately stop using   all IKEA children’s chests and dressers taller than 23 ½ inches and   adult chests and dressers taller than 29 ½ inches, unless they are   securely anchored to the wall.  The free wall anchoring kit should be   used to secure MALM and other IKEA chests and dressers to the wall.     About 7 million MALM chests and 20 million other IKEA chests and dressers are part of the nationwide repair program.     CPSC and IKEA received a report that in February 2014, a 2-year-old   boy from West Chester, Pa. died after a MALM 6-drawer chest (48 3/8   inches high) tipped over and fatally pinned him against his bed. CPSC   and IKEA also received a report that in June 2014, a 23-month old child   from Snohomish, Wash. died after he became trapped beneath a 3-drawer   (30 ¾ inches high) MALM chest that tipped over. Neither chest had been   secured to the wall.  IKEA and CPSC have also received 14 reports of   tip-over incidents involving MALM chests, resulting in four injuries.   Since 1989, IKEA is aware of three additional reports of deaths from   tip-overs involving other models of IKEA chests and dressers.     IKEA is offering U.S. consumers a wall anchoring repair kit free of   charge for use with the MALM chests, IKEA children’s chests and dressers   taller than 23 ½ inches, and IKEA adult chests and dressers taller  than  29 ½ inches. The kit contains replacement tip-over restraints for  use  by any consumer who has not secured their IKEA chest or dresser to  the  wall. The kit also includes complete wall anchoring hardware,   instructions and warning labels to be affixed to the furniture.     CPSC and IKEA are urging consumers to inspect their IKEA chests and   dressers to ensure that they are securely anchored to the wall.   Consumers should move unanchored chests and dressers into storage or   other areas where they cannot be accessed by children until the chests   and dressers are properly anchored to the wall.     The MALM chests that are part of the repair program were sold starting in 2002.  The price of the chests range from about $80 to $200.     To receive a free wall anchoring kit, visit an IKEA retail store, go to www.IKEA-USA.com/saferhomestogether, or call (888) 966-4532.     A child dies every two weeks and a child is injured every 24 minutes   in the U.S. from furniture or TVs tipping over, according to CPSC data.   To help prevent injuries and deaths, CPSC and IKEA urge consumers to   securely anchor furniture and TVs to prevent these tragedies and make   their home a safer place. For more information, visit www.AnchorIt.gov and www.IKEA-USA.com/saferhomestogether.",
    "Repair Number": 15190
  },
  {
    "Title": "Getallfun Recalls High-Powered Magnetic Ball Sets Due to Ingestion Hazard; Failure to Meet Federal Safety Regulation for Toy Magnet Sets",
    "Date": "3/7/2024",
    "Summary": "This recall involves 5mm Magnetic Balls which are small, spherical, loose, and separable neodymium rare-earth magnets with a strong magnetic flux. The 5mm diameter magnets are sold in a set of 216 magnetic balls in various colors and encased in a clear, plastic case and a portable tin storage box.",
    "Repair Number": 24147
  },
  {
    "Title": "High-Powered Magnetic Ball Sets Recalled Due to Ingestion Hazard; Violation of the Federal Safety Regulation for Toy Magnet Sets; Sold Exclusively on Walmart.com through Joybuy",
    "Date": "3/7/2024",
    "Summary": "This recall involves 5mm (.2 inch) magnetic balls which are small, spherical, loose and separable neodymium rare-earth magnets with a strong magnetic flux. The 5mm-diameter magnets are sold in a set of 226 multi-colored magnetic balls encased in a clear, plastic case and a portable, tin storage box. The set includes a black storage bag.",
    "Repair Number": 24144
  },
  {
    "Title": "Jool Baby Recalls Nova Baby Infant Swings Due to Suffocation Hazard; Violation of the Federal Safety Regulations",
    "Date": "3/7/2024",
    "Summary": "The recall involves Jool Baby's Nova Baby infant swings, manufactured from June 2022 through September 2023. The recalled swings are gray and measure about 28 inches long, 19 inches wide and 24 inches high. They have a round aluminum base with music buttons on the front, a metal seat frame, a cloth seat with restraints and a headrest, and a canopy with hanging toys (yellow moon, blue cloud, and pink star.) The swings can be powered using AAA batteries or an AC adaptor and came with an electronic remote control. \"Jool Baby\" appears on the swing's base and \"NOVA\" on the seat label. The manufacturing date code in month, day, year format can be found on the sewn-in warning label on the back of the swing's seat.",
    "Repair Number": 24145
  },
  {
    "Title": "Anker EverFrost Lithium-Ion Battery Powered Coolers Recalled Due to Battery Fire Hazard; Manufactured by Anker Innovations",
    "Date": "3/7/2024",
    "Summary": "This recall involves the lithium-ion battery packs in Anker EverFrost Coolers. The coolers are intended for use in outdoor camping, travel and fishing for cooling and freezing food or medicine. They are dark gray with wheels and a drop-down rolling handle. There is a blue charging port for charging by alternative power sources, such as plug-in or solar, on one end of the cooler. The name \"Anker EverFrost\" appears on the side in silver and blue. The model number is printed on the outer surface on the bottom of the cooler. The following model numbers are included in this recall: Product Model # Size Anker Detachable Battery pack for Powered Cooler A17B0 Not Applicable Anker EverFrost Powered Coolers 30 A17A0 33 Liter Anker EverFrost Powered Coolers 40 A17A1 43 Liters Anker EverFrost Powered Coolers 50 A17A2 53 Liters",
    "Repair Number": 24146
  },
  {
    "Title": "GT Recalls LaBomba Bicycles Due to Fall and Injury Hazards",
    "Date": "3/7/2024",
    "Summary": "This recall involves GT Model Year 2019 through 2023 LaBomba 24\" bicycles, LaBomba 26\" bicycles, LaBomba Pro bicycles, LaBomba Rigid bicycles, and LaBomba 26\" bicycle framesets. The bicycles and framesets were sold in sea green, green, dusty blue, blue, purple, and red. The model name LaBomba is printed on the bicycle frame top-tube. \"GT\" is printed on the downtube.",
    "Repair Number": 24148
  },
  {
    "Title": "Yamaha Corporation of America Recalls Power Adaptors Due to Electrical Shock and Electrocution Hazards",
    "Date": "3/7/2024",
    "Summary": "This recall involves Yamaha's PA-10 AC Power Adaptors with date codes ranging from 2126 to 2319. Yamaha is printed on the front of the black power adapter. The date code is printed on the back. Yamaha's PA-10 AC Power Adapter was bundled with five Yamaha analog mixing console models - MG10, MG10X CV, MG10XU, MG10XUF, and MG12XUK - and sold as a stand-alone replacement part. Only Yamaha's PA-10 AC Power Adapter is being recalled.",
    "Repair Number": 24149
  },
  {
    "Title": "Sleep Technologies Recalls Eco Terra Mattresses Due to Fire Hazard; Violation of Federal Mattress Flammability Regulation; Sold Exclusively on Ecoterrabeds.com",
    "Date": "3/7/2024",
    "Summary": "This recall involves model ECO TERRA Eco Terra Mattresses manufactured from Aug 5, 2022 to Aug 18, 2022. The mattresses are 10 inches thick with a top panel that is ivory and quilted. The side panel is brown knit quilted with horizontal lines, and the top and bottom tape edges are ivory. The manufacture dates and model name \"ECO TERRA\" are located on the mattress label, sewn into the cover.",
    "Repair Number": 24150
  },
  {
    "Title": "Fossil Group Recalls Bracelet Sold with Skechers Jewelry Gift Sets Due to High Levels of Lead and Cadmium",
    "Date": "3/7/2024",
    "Summary": "This recall involves the braided black bracelet that is a part of the Skechers watch/bracelet gift set. The bracelet is black and features a braided pattern with a metal clasp on each end. The watch in the gift set has a code number \"IF2812307\" printed on the back of the watch as well as \"Sketchers\" and model number \"SR9082\".",
    "Repair Number": 24151
  },
  {
    "Title": "TJX Recalls Children's Brown Stretch Twill Pants Sets Due to Choking Hazard; Sold Exclusively at Marshalls",
    "Date": "3/7/2024",
    "Summary": "This recall involves Tommy Bahama brand brown stretch twill children's pants with rib cuffs and with a drawstring that were sold as part of a set with either a blue or green butter fleece crewneck top with an embroidered winking smiley face by the left shoulder. The pants were sold in sizes 18M to 5T. The sewn-in label on the pants is printed with \"Suzhou Megatex Import And Export\" and the style number CP08513. Only the pants in the set are included in this recall.",
    "Repair Number": 24152
  },
  {
    "Title": "SINGES 3-in-1 High Chair and Booster Seats Recalled Due to Fall Hazard; Violations of the Federal Safety Regulations for High Chairs and Booster Seats; Sold Exclusively at Walmart.com; Imported and Sold by Shenzhen Yingjieshang Trade",
    "Date": "3/7/2024",
    "Summary": "This recall involves SINGES 3-in-1 Baby High Chairs and Booster Seats. The high chair has a light blue cushioned seat, detachable legs and adjustable tray that can be converted into a booster seat with shorter legs or wheels. The high chairs were sold in blue and red colors.",
    "Repair Number": 24153
  },
  {
    "Title": "Textron Specialized Vehicles Recalls Arctic Cat Catalyst 600 Snowmobiles Due to Injury Hazard",
    "Date": "3/7/2024",
    "Summary": "This recall involves all model year 2024 Arctic Cat Catalyst 600 series snowmobiles. The snowmobiles were sold in various colors and model name \"ZR,\" \"Riot\" or \"Mountain\" printed on each side of the engine cowling.",
    "Repair Number": 24154
  },
  {
    "Title": "Bubble Bear Crib Mattresses Recalled Due to Fire Hazard; Violations of the Federal Safety Regulation for Mattresses; Sold Exclusively on Amazon.com by Coral Island",
    "Date": "3/7/2024",
    "Summary": "This recall involves Bubble Bear brand crib mattresses with a manufacture date of 4/2022 from batch number 20220428CD. It includes models \"Gray Style\" and \"Happy Time.\" The Gray Style has a gray top with a crisscross white pattern and off-white sides, and is labeled model CD-03. The Happy Time has a white top with paint brush, boat, and mountain print, and is labeled model CD-02. \"Bubble Bear\" is printed on a sewn-in tag with a teddy bear on both models.",
    "Repair Number": 24155
  },
  {
    "Title": "Vernier Science Education Recalls \"Go Direct\" Charge Stations Due to Burn Hazard",
    "Date": "2/29/2024",
    "Summary": "This recall involves the Vernier Go Direct Charge Station, which supports the Go Direct line of wireless sensors containing rechargeable batteries. The Vernier Go Direct sensors are widely used in educational settings by teachers and students to conduct a variety of science experiments, including collecting data on temperature measurements, O2 levels, CO2 levels, pH values, and more. The Vernier Go Direct Charge Stations can charge up to 16 Vernier Go Direct sensors at the same time - 8 via USB and 8 via Go Direct wand-style sensor ports. The product is marked as \"Go Direct® Charging Station\" and can be identified by the order code GDX-CRG and model number GDXCRG2617R1, found on a label located at the bottom of the Charge Station. This product may have been purchased individually or as a part of a Teacher Pack of sensors with order codes GDX-TMP-TP or GDX-PH-TP.",
    "Repair Number": 24132
  },
  {
    "Title": "Vanilla Underground Minecraft TNT Children's Pajamas Recalled Due to Burn Hazard and Violation of Federal Flammability Regulations; Imported by Premier P",
    "Date": "2/29/2024",
    "Summary": "The \"Minecraft All Over Creeper TNT\" garment is a hooded one-piece pajama with a soft, raised fabric printed with green Creepers and TNTs from the Minecraft video game. There are bright green cuffs on the wrists and ankles, a bright green zipper that extends from the neck to the waist, and a hood. On the front of the neck label is the word \"Minecraft\" and on the back of the label is \"2023 Mojang AB. TM Microsoft Corporation\". On the front of the side-seam label is Vanilla Underground's logo, \"Vanilla Underground\", \"vanillaunderground.com\" and Vanilla Underground's address. The back of the side-seam label lists the washing instructions, \"Made in China\", \"100% Polyester\" and \"Keep away from fire\".",
    "Repair Number": 24133
  },
  {
    "Title": "Mobile Stands for Large Interactive Flat Panel Displays Recalled Due to Tip-Over and Entrapment Hazards; Imported by SMART Technologies",
    "Date": "2/29/2024",
    "Summary": "This recall involves SMART Technologies' Electric Height-Adjustable Mobile Stands for Large Interactive Flat Panel Displays. The recalled stands have model numbers FSE-400 (worldwide) and FSE-410 (US and Canada). They are white in color and have a wheelbase with four wheels. The model number, serial number and SMART logo are located on a label on the back of the mobile stand. Consumers should go online to https://support.smarttech.com/docs/accessories/stands-and-wall-mounts/fse-400/en/important-info/important-info.cshtml to see if their serial number is included in this recall.",
    "Repair Number": 24134
  },
  {
    "Title": "Oso & Me Recalls Children's Pajama Sets Due to Burn Hazard; Violation of the Federal Flammability Regulations for Children's Sleepwear",
    "Date": "2/29/2024",
    "Summary": "This recall involves Oso & Me's 100% cotton children's long sleeve, two-piece pajama sets. The \"Animal Party\" style pajama sets are light blue with dark blue velvet piping, and have a print of lions, zebras, flamingos, monkeys, and bears. The recalled pajama sets were sold in sizes 3Y, 4Y, 5Y, 6Y, 7Y and 8Y and come with a reusable cotton gift bag with matching fabric. \"Oso & Me\" and the size are printed on the neck label and waist band label. \"RN15567\", \"Made in Sri Lanka\", and the care instructions appear on the side seam.",
    "Repair Number": 24135
  },
  {
    "Title": "Cannondale Recalls Dave Bicycles Due to Fall and Injury Hazards",
    "Date": "2/29/2024",
    "Summary": "This recall involves Model Year 2021 through 2023 Cannondale 26\" Dave bicycles and framesets. The bicycles and framesets were sold in deep teal and stealth gray. \"Dave\" is printed on the bicycle frame top-tube. \"Cannondale\" is printed on the downtube.",
    "Repair Number": 24136
  },
  {
    "Title": "The Home Appliances Recalls Camplux Brand Portable Tankless Water Heaters Due to Fire Hazard",
    "Date": "2/29/2024",
    "Summary": "This recall involves certain Camplux brand portable tankless water heaters with model numbers AY132, BD158, BW211, BW264, and BW422, with the following sizes and manufacturing dates: Model Product Details Manufacture Date AY132 5L 1.32 GPM 34,000 btu/hr On or before September 17, 2021 BD158 6L 1.58 GPM 41,000 btu/hr On or before November 17, 2021 BW211 8L 2.11 GPM 55,000 btu/hr On or before November 17, 2021 BW264 12.8L 2.64 GPM 68,000 btu/hr On or before November 17, 2021 BW422 16L 4.22 GPM 110,000 btu/hr On or before December 20, 2021 These water heaters were designed and intended for outdoor use with an attached propane tank to quickly heat water for showering or other hot water needs. The water heaters were sold in white, black, and silver/gray colors. The \"Camplux\" logo is printed on the front of the unit. The product label is located on the side of the unit and includes the model, size and other product details, serial numbers, and brand information. Consumers will be directed to take a photograph of the label on their Camplux water heater product and send to Camplux to confirm that they have a recalled water heater to receive the replacement gas regulator.",
    "Repair Number": 24137
  },
  {
    "Title": "Children's Pajamas Recalled Due to Burn Hazard and Violation of Federal Flammability Standards; Sold Exclusively by Liverpool Football Club",
    "Date": "2/29/2024",
    "Summary": "This recall involves 17 styles of Liverpool Football Club-branded children's pajamas (four sleepsuits and 13 pajama sets). The pajama sets were sold in sizes 9-12 Months, 12-18 Months, 18-24 Months, 3-4 Years, 5-6 Years, 7-8 Years, 9-10 Years, and 11-12 Years. The size and \"L.F.C.\" are printed on the red neck label. \"L.F.C.\", the product code, \"Made in China\", the fiber content, and the washing instructions are printed on a sewn-in, side-seam label. Product Name Product Code Color Fabric content LFC Baby 2 Pack Sleep Suit A21RV01 Navy/Gray; Red/Gray/White 100% Cotton LFC Junior Short PJ Set A21PF13 Top: Gray/Red/Navy Blue/White; Bottom: Red/Navy Blue Top: 92% Cotton, 8% Polyester; Bottom: 100% Cotton LFC Junior Red Long PJ Set A21PF14 Top: Red/White; Bottom: Red/White/Yellow 100% Cotton LFC Junior Gray Long PJ Set A21PF16 Top: Gray/Pink/Red; Bottom: Gray/Pink 98% Cotton, 2% Polyester LFC Junior Striped Short PJ Set A21PF17 Top: Red/Gray/Blue/White; Bottom: Gray/Red 98% Cotton, 2% Polyester LFC Junior Short PJ Set A22PF15 Gray/Red Top: 95% Cotton, 5% Viscose; Bottom: 100% Cotton LFC Junior Red/Gray Long PJ Set A22PF16 Top: Gray/Red; Bottom: Red/White Top: 92% Cotton, 8% Polyester; Bottom: 100% Cotton 100% Cotton Black/White Bottom: 100% Cotton Bottom: 100% Cotton Bottom: 100% Cotton Bottom: 98% Cotton, 2% Polyester Bottom: Gray/Red Bottom: Gray/White Bottom: Red/White LFC 2 Pack Red & Gray Baby Sleep Suits A22RV02 Red/White 100% Cotton LFC 23/24 Away Sleepsuit S23MN15 Green/White/Black 100% Cotton LFC 23/24 Home Baby PJ Set S23MN08 Red/White 100% Cotton LFC 23/24 Home Baby Sleep Suit S23MN09 Red/White 100% Cotton LFC Junior Heart Long PJ Set A22PF19 LFC Juniors Long Pajama Set Charcoal Red A23TM15 LFC Juniors Long Pajama Set Charcoal Red A23TM16 LFC Juniors Short Pajama Set Charcoal Red A23TM33 Top: Red/Gray/White; Bottom: Red/White Top: 65% Polyester, 35% Cotton; Bottom: 100% Cotton LFC Juniors Long Pajama Set Charcoal Red A23TM16 Top: Gray/Red Pants: Gray/White Top: 65% Polyester, 35% Cotton; Bottom: 100% Cotton LFC Blippi Long Pajamas A23BL13 Red/Orange/Blue/Yellow/Black/White 100% Cotton",
    "Repair Number": 24138
  },
  {
    "Title": "Bombardier Recreational Products (BRP) Recalls Ski-Doo Snowmobiles Due to Risk of Serious Injury and Crash Hazard",
    "Date": "2/29/2024",
    "Summary": "This recall involves all model year 2024 Ski-Doo MXZ and Renegade snowmobiles models equipped with Pilot X skis. The vehicles were sold in a variety of colors. Ski-Doo and the model name are printed on the side panels of the vehicles. Pilot X is engraved at the back of the ski, on the upper side. The vehicle identification number (VIN) is on the decal located on the right-hand side of tunnel underneath the seat. Dealers can check for VINs included in this recall.",
    "Repair Number": 24140
  },
  {
    "Title": "Sandford Family Croquet Sets Recalled Due to Violations of the Federal Lead Paint and Phthalates Bans; Sold Exclusively on Amazon by DOM Sports",
    "Date": "2/29/2024",
    "Summary": "This recall involves Sandford Family 6-Player Croquet Sets branded with either Garden Games or Big Game Hunters on the storage bag. The set includes four adult mallets; two winning posts; one red and blue children's mallet; six balls, clips and hoops, and a storage bag. The storage bag is branded with either a Big Game Hunters logo on a blue bag or a Garden Games logo on a green bag.",
    "Repair Number": 24141
  },
  {
    "Title": "Nutraceutical Recalls Heritage Store Hydrogen Peroxide Mouthwash Due to Risk of Poisoning; Violation of Child Resistant Packaging Requirement",
    "Date": "2/29/2024",
    "Summary": "This recall involves Heritage Store Hydrogen Peroxide Mouthwash in Wintermint and Eucalyptus Mint flavors. The bottles are a dark opaque brown with a white lid. The pink and white label on the front of the bottles displays the Heritage Store logo, product name and flavor. All lots are included in the recall.",
    "Repair Number": 24142
  },
  {
    "Title": "JURLEA Rugs Recalled Due to Fire Hazard; Violation of Federal Flammability Regulations; Sold Exclusively on Amazon.com by Yalande-US",
    "Date": "2/22/2024",
    "Summary": "This recall involves two styles of large area rugs sold in three different sizes. The rugs come in neutral, multicolor designs. No labels are present on the product. Color Sizes Light Gray/Ivory 5'3\" x 6'6\" 6'6\" x 8'2\" 6'6\" x 9'10\" Gray Beige/Light Yellow 5'3\" x 6'6\" 6'6\" x 8'2\" 6'6\" x 9'10",
    "Repair Number": 24123
  },
  {
    "Title": "EVAS 20 lb. Propane Exchange Tanks Recalled by Worthington Enterprises Due to Fire Hazard",
    "Date": "2/22/2024",
    "Summary": "This recall involves EVAS 20-lb. propane exchange cylinders with model number EVAS - M0859, a serial number beginning with a \"W,\" and a date code of either \"06-23\" or \"07-23.\" The model number, serial number, and date code are stamped on the collar of the cylinder. While the cylinders were initially sold with an AmeriGas label, consumers could have exchanged these cylinders with other propane distributors who would have then placed their own branded sleeve/label on them.",
    "Repair Number": 24124
  },
  {
    "Title": "IKEA Recalls USB Chargers Due to Burn and Electric Shock Hazards",
    "Date": "2/22/2024",
    "Summary": "This recall involves IKEA ÅSKSTORM 40W USB Chargers. The product consists of a charger and a detachable power cord with a C7 connector and a plug. Model number ICPSW5-40-1 is printed on the label on the back side of the gray USB charger.",
    "Repair Number": 24125
  },
  {
    "Title": "Cascade Designs Recalls Camping Cooking Pots Due to Burn and Scald Hazards",
    "Date": "2/22/2024",
    "Summary": "This recall involves select Cascade Designs camping cooking pots. The anodized aluminum pots are various 1- to 2-liter pots sold individually and as a part of stove systems and kits. The recalled models include Reactor, Trail Lite and PocketRocket Stove Kits. MSR is written on the side of the pots.",
    "Repair Number": 24126
  },
  {
    "Title": "Biometric Gun Safes Recalled Due to Serious Injury Hazard and Risk of Death; Imported by Awesafe",
    "Date": "2/22/2024",
    "Summary": "This recall involves certain Awesafe biometric gun safes. The recalled gun safes are black, can fit two pistols, and have the brand name \"Awesafe\" on the front.",
    "Repair Number": 24127
  },
  {
    "Title": "Biometric Gun Safes Recalled Due to Serious Injury Hazard and Risk of Death; Sold Exclusively on Amazon.com by BBRKIN",
    "Date": "2/22/2024",
    "Summary": "This recall involves BBRKIN Biometric Gun Safe model number QCJJ01. The gray steel safe is used to store firearms and valuables. It measures about 13 inches by 14 inches by 15 inches. It has one shelf and can store approximately 5 firearms. The serial number is on a label on the front of the safe in the lower right corner of the safe and the brand name \"MouTec\" appears on the front of the safe. The safes have the following serial range: SQC202121000 through SQC202247603.",
    "Repair Number": 24128
  },
  {
    "Title": "Machir Recalls Biometric Personal Safes Due to Serious Injury Hazard and Risk of Death",
    "Date": "2/22/2024",
    "Summary": "This recall involves certain Machir biometric personal safes used to store personal items. They measure about 10 inches by 14 inches by 10 inches. The serial numbers are located on the lower righthand corner of the front door of the safe. The following serial number ranges are included in this recall: SW190035551 - SW190038050 SW190070151 - SW190072650 SW190175401 - SW190175857 SW190262061 - SW190264301 SVA2001200005001 - SVA2001200007000 SVA2001200014632 - SVA2001200014995 SVA2001200015001 - SVA2001200017577 SVA2001200086685 - SVA2001200089624 SVA2001200164001 - SVA2001200165000 SVA2001200115471 - SVA2001200119880 SVA2001200122399 - SVA2001200124758 SVA2001200172611 - SVA2001200174080",
    "Repair Number": 24129
  },
  {
    "Title": "Bulldog Cases Recalls Biometric Gun Safes Due to Serious Injury Hazard and Risk of Death",
    "Date": "2/22/2024",
    "Summary": "This recall involves Bulldog Magnum Biometric Pistol Vaults, Magnum Biometric Pistol Vaults with Shelf, and Magnum Biometric Top Load Pistol Vaults. The black steel safes are used to store firearms and valuables. The pistol vault (BD4030B) measures 11.5 inches by 8 inches by 5.5 inches, and the pistol vault with shelf (BD4040B) measures 11.5 inches by 10 inches by 8 inches. The top load pistol vault (BD4055B) measures 11.5 inches by 9.8 inches by 2.5 inches. The pistol vault with shelf has one shelf and can store approximately two firearms. The model number can be found on a label on a silver sticker on the back right corner of the safe, and the brand name \"Bulldog\" appears on the front of the safe. Name Model Number Magnum Biometric Pistol Vault BD4030B Magnum Biometric Pistol Vault with Shelf BD4040B Magnum Biometric Top Load Pistol Vault BD4055B",
    "Repair Number": 24130
  },
  {
    "Title": "Magik & Kover Pack and Play Mattresses Recalled Due to Suffocation Hazard for Infants; Violations of the Federal Safety Regulation for Crib Mattresses; Sold Exclusively on Amazon.com by Magik & Kover (Recall Alert)",
    "Date": "2/22/2024",
    "Summary": "This recall involves Magik & Kover pack and play mattresses manufactured from August 2022 through July 2023. The waterproof play yard mattress topper has a white mattress cover. \"CertiPUR-US\" is printed in a tag inside the cover, and batch number 221002US and the manufacture date in the format \"PD DD.MM/YYY\" are printed on the back of that tag. \"STANDARD 100\" is printed on another tag.",
    "Repair Number": 24738
  },
  {
    "Title": "Spring Spirit and Biloban Pack and Play Mattresses Recalled Due to Suffocation Hazard to Infants; Violations of the Federal Safety Regulation for Crib Mattresses; Sold Exclusively on Amazon.com by Biloban (Recall Alert)",
    "Date": "2/22/2024",
    "Summary": "This recall involves Spring Spirit (Amazon's ASIN B086X5RKRZ) and Biloban (Amazon's ASIN B09WMP2BS3) pack and play mattress. The Spring Spirit mattress is a trifold mattress with a bamboo pattern print, manufactured from August 2022 through July 2023. \"Spring Spirit\" is printed on a tag located on one side of the mattress, and batch number 230315US and the manufacture date in the format \"PD DD.MM/YYY\" are printed on another tag located on the opposite side of the mattress. The Biloban mattresses are white and \"Biloban\" and gray stars are printed on the top. The underside of the mattress is gray. They were manufactured from August 2022 through July 2023. \"Biloban\" is printed on the mattress' hangtag, and batch number 2304US and the manufacture date in the format \"PD DD.MM/YYY\" are printed on a tag stapled to the mattress cover.",
    "Repair Number": 24739
  },
  {
    "Title": "Polaris Recalls MATRYX Snowmobiles Equipped with PATRIOT 650 and 850 Engines Due to Injury Hazard (Recall Alert)",
    "Date": "2/22/2024",
    "Summary": "This recall involves certain Polaris Model Year 2022-2024 MATRYX Voyageur, Indy, Switchback, RMK, and SKS snowmobiles. The recalled snowmobiles were sold in black and custom color combinations and equipped with PATRIOT 650 and 850 engines. The recall also includes primary (drive) clutches sold as service parts with part numbers 1323613 (e-start) and 1323614 (manual start). \"POLARIS\" is stamped on the front side panel of the vehicles. The VIN and model number are located on the right side of the vehicle's frame. The following models are being recalled: Recalled Model Description Recalled Snowmobiles Model Description Model Year 2022 650 MATRYX VOYAGEUR 146 Model Year 2022 650 MATRYX INDY Model Year 2022 850 MATRYX INDY Model Year 2022 650 MATRYX SWITCHBACK Model Year 2022 850 MATRYX SWITCHBACK Model Year 2022 650 MATRYX RMK Model Year 2022 850 MATRYX RMK Model Year 2023 650 MATRYX INDY Model Year 2023 850 MATRYX INDY Model Year 2023 650 MATRYX SWITCHBACK Model Year 2023 850 MATRYX SWITCHBACK Model Year 2023 650 MATRYX VOYAGEUR 146 Model Year 2023 650 MATRYX SKS 146 Model Year 2023 650 MATRYX RMK Model Year 2023 850 MATRYX RMK Model Year 2024 850 MATRYX RMK",
    "Repair Number": 24740
  },
  {
    "Title": "Dynabook Americas Recalls 15.5 Million Toshiba Laptop AC Adapters Due to Burn and Fire Hazards",
    "Date": "2/21/2024",
    "Summary": "This recall involves AC adapters sold with Toshiba brand personal laptop computers as well as sold separately. They have date codes between April 2008 through December 2012 in either a year month, date format, i.e. April 2008 is 0804, or year week, date format, i.e. week 15 of 2008 is 0815. The AC adapters are black and have the following model numbers and serial numbers and date codes printed on the AC adapter rating label. Brand Name Model Name /Number Serial Number format with embedded date code Date Code Toshiba G71C0009S110 T**0815********** ~ T**1253********** (Year 2008 Week 15 to Year 2012 Week 53) 0815 - 1253 G71C0009S111 0815 - 1253 G71C0009S112 0815 - 1253 G71C0009S113 0815 - 1253 G71C0009S114 0815 - 1253 G71C0009S115 0815 - 1253 G71C0009S210 0815 - 1253 G71C0009S212 0815 - 1253 G71C0009S214 0815 - 1253 G71C0009S410 0815 - 1253 G71C0009S411 0815 - 1253 G71C0009S412 0815 - 1253 G71C0009S413 0815 - 1253 G71C0009S414 0815 - 1253 G71C0009S415 0815 - 1253 G71C0009T110 T0815********** ~ T1253********** (Year 2008 Week 15 to Year 2012 Week 53) 0815 - 1253 G71C0009T111 0815 - 1253 G71C0009T112 0815 - 1253 G71C0009T113 0815 - 1253 G71C0009T114 0815 - 1253 G71C0009T115 0815 - 1253 G71C0009T116 0815 - 1253 G71C0009T117 0815 - 1253 G71C0009T210 0815 - 1253 G71C0009T212 0815 - 1253 G71C000AE110 T0815********** ~ T1253********** (Year 2008 Week 15 to Year 2012 Week 53) 0815 - 1253 G71C000AE111 0815 - 1253 G71C000AE112 ***0804******** ~ ***1212******** (Year 2008 Month 4 to Year 2012 Month 12) 0804 - 1212 G71C000AE113 0804 - 1212 G71C000AE210 T0815********** ~ T1253********** (Year 2008 Week 15 to Year 2012 Week 53) 0815 - 1253 G71C000AE212 ***0804******** ~ ***1212******** (Year 2008 Month 4 to Year 2012 Month 12) 0804 - 1212 G71C000AE410 T0815********** ~ T1253********** (Year 2008 Week 15 to Year 2012 Week 53) 0815 - 1253 G71C000AE411 0815 - 1253 G71C000AE412 ***0804******** ~ ***1212******** (Year 2008 Month 4 to Year 2012 Month 12) 0804 - 1212 G71C000AE413 0804 - 1212 G71C000AR110 0804 - 1212 G71C000AR210 0804 - 1212 G71C000AR310 0804 - 1212 G71C000AR410 0804 - 1212 G71C000AS110 0804 - 1212 G71C000AS410 0804 - 1212 G71C000BY110 T0815********** ~ T1253********** G71C000BZ110 G71C000DH110 0815 - 1253 G71C000DH410 0815 - 1253 G71C000DJ110 0815 - 1253 G71C000DJ410 0815 - 1253 G71C000DM110 0815 - 1253 G71C000DM410 0815 - 1253 G71C000DN110 0815 - 1253 G71C000DN410 0815 - 1253 G71C000DP110 ***0804******** ~ ***1212******** (Year 2008 Month 4 to Year 2012 Month 12) 0804 - 1212 G71C000DP410 0804 - 1212 G71C000DQ110 0804 - 1212 G71C000DQ410 0804 - 1212 G71C000DU110 T0815********** ~ T1253********** (Year 2008 Week 15 to Year 2012 Week 53) 0815 - 1253 G71C000DX110 0815 - 1253 G71C000DX410 0815 - 1253 G71C000DY110 0815 - 1253 G71C000DY410 0815 - 1253 G71C000F7110 0815 - 1253 PA1750-04 0815 - 1253",
    "Repair Number": 24122
  },
  {
    "Title": "Bell Sports Recalls Bell Soquel Youth Bicycle Helmets Due to Risk of Head Injury; Violation of the Federal Safety Regulation for Bicycle Helmets",
    "Date": "2/15/2024",
    "Summary": "This recall only involves Bell Soquel Youth helmets made prior to September 2021. The helmets were sold in various colors in the U.S. and Canada. The recalled helmet can be identified by the inner helmet sticker which has the model's name \"Soquel\" and \"B0726Y\" written on it. The helmets have a date code on the white inner label with August 2021 (\"8/21\") or earlier. SKU Product Name Model Name Country Sold 7094740 Youth Soquel Black / Red Mips Bell Soquel Youth MIPS U.S. 7094741 Youth Soquel Blue Lagoon / Orange Bell Soquel Youth U.S. 7107133 Youth Soquel Blue Lagoon / Orange Bell Soquel Youth U.S. 7107134 Youth Soquel Black / Red Mips Bell Soquel Youth MIPS U.S. 7097932 Youth Soquel Blue Lagoon/Poppy Bell Soquel Youth Canada 7097933 Youth Soquel Matte Black Bell Soquel Youth Canada 7097934 Youth Soquel Matte Black Mips Bell Soquel Youth MIPS Canada",
    "Repair Number": 24118
  },
  {
    "Title": "Char-Broil Recalls Digital Electric Smokers Due to Risk of Electric Shock",
    "Date": "2/15/2024",
    "Summary": "This recall involves Char-Broil digital electric smokers with the following model descriptions: Digital Electric Smoker; Digital Electric Smoker w/Window; Digital Electric Smoker, Black w/Window; Digital Electric Smoker, Medallion; Digital Electric Smoker, Connected; and Digital Electric Smoker, XL. These electric smokers were designed and intended only for outdoor use to cook without charcoal. The smokers were sold in black and stainless-steel finishes. The \"Char-Broil\" logo plate is on the front of the unit. The product label is located on the outside back of the unit and includes the model and serial numbers and brand information. UPC codes, located on the packaging, are included in this recall with the model description and item numbers as follows: Model Description Model No. UPC Digital Electric Smoker 14202002 17202002 14202002-A1 17202002-A1 99143020020 Digital Electric Smoker, w/Window 14202004 17202004 14202004-A1 17202004-A1 099143020044 Digital Electric Smoker, Black w/Window 19202101 099143021010 Digital Electric Smoker, Medallion 463246619 047362324665 Digital Electric Smoker, Connected 15202043 17202043 15202043-A1 17202043-A1 099143020433 Digital Electric Smoker, XL  099143020051",
    "Repair Number": 24116
  },
  {
    "Title": "Electrolux Group Recalls Frigidaire Rear-Controlled Ranges Due to Electric Shock and Electrocution Hazards",
    "Date": "2/15/2024",
    "Summary": "This recall involves select Frigidaire brand rear-controlled ranges produced from October 2023 through November 2023 with electronic control panels and the following model and serial numbers within these ranges: Model Number Serial Number Range FCRE3052BW VF34618193 thru VF34618322 FCRE305CBW VF34601466 thru VF34601608 FCRG3051BB VF34508449 thru VF34508592, VF34521553 thru VF34521696, VF34521697 thru VF34521835 FCRG3051BW VF34504801 thru VF34504942 FCRE3062AB VF34424109 thru VF34424252 FCRG3052BW VF34510705 thru VF34510818 FCRE3052BB VF34414413 thru VF34414546, VF34600745 thru VF34600888, FCRE3052BS VF34413405 thru VF34413692 FCRE306CAS VF34410621 thru VF34410752 VF34410338 thru VF34410338, VF34413117 thru VF34413260, VF34512157 thru VF34512300, VF34512673 thru VF34512816, VF34519273 thru VF34519416 FCRG3051BS VF34316279 thru VF34316279. Consumers should visit https://www.frigidaire.com/en/frigidaire-recall-information to see if their specific serial number is included in this recall. The model and serial numbers are located in the drawer beneath the oven.",
    "Repair Number": 24117
  },
  {
    "Title": "BRS and BULin Liquid Fuel Bottles Recalled Due to Risk of Poisoning, Burn, and Flash Fire; Violation of the Children's Gasoline Burn Prevention Safety Act and the Portable Fuel Container Safety Act; Sold Exclusively on Amazon.com by WAOLi",
    "Date": "2/15/2024",
    "Summary": "This recall involves WAOLi's BRS and BULin portable liquid fuel bottles manufactured from February 2023 to July 2023, sold individually and as a pair. The BRS bottle is orange with a black cap and was sold in 500mL, 530mL, and 750mL capacities. The BULin bottle is red with a red cap and was sold in 1500mL capacity. \"BRS\" or \"BULin,\" the bottle's volume, warnings, and/or directions appear in white lettering on the bottles.",
    "Repair Number": 24119
  },
  {
    "Title": "FeraDyne Outdoors Recalls Rhino Climbing Sticks Due to Fall and Laceration Hazards",
    "Date": "2/15/2024",
    "Summary": "This recall involves Rhino branded 24-foot Hot Foot Climbing Sticks used in game hunting. They have extended tree braces with angled steps in six four-foot stick sections. The model name \"RTSL-24\" and lot codes are printed on a label attached to the support pole. Lot codes with calendar year 2023 and all previous years are included in this recall. The lot codes have a two-digit year followed by a two-digit month, i.e., 2312xx, 2212xx.",
    "Repair Number": 24120
  },
  {
    "Title": "Ocean State Job Lot Recalls \"Growing Table-Mini Greenhouse and Raised Garden Bed\" Due to Fire Hazard",
    "Date": "2/15/2024",
    "Summary": "This recall involves the Calipso \"Combi\" and Tiller & Rowe \"Growing Table-Mini Greenhouse and Raised Garden Bed\" products. The assembled height is 32\" x 15\" x 39\". The assembled product has an opaque cover with vents. It also has a storage shelf below the garden bed. The garden bed portion and legs are gray. The interior liner is lime green and has a removeable grid to space out seedlings.",
    "Repair Number": 24121
  },
  {
    "Title": "Vornado Recalls Two Million Handheld Garment Steamers Due to Serious Burn Hazard",
    "Date": "2/8/2024",
    "Summary": "This recall involves three different brands of handheld garment steamers: Steamfast model numbers SF-425, SF-435, SF-440, SF-445, and SF-447; Vornado model number VS-410; and Sharper Image model number SI-428. The recalled steamers were sold in the following colors: SF-435 (white, black, light pink, hot pink, sage green, orange, and teal blue); SF-425, SF-440, SF-445, SI-428, and SF-447 (white); and VS-410 (black). The recalled steamers are handheld electrical appliances which use hot steam emitted from a nozzle to remove wrinkles from clothing and other fabrics. The steamers' brand name appears on the side of each unit and on a label located on the bottom of the steamer. The model number also appears on the label.",
    "Repair Number": 24109
  },
  {
    "Title": "Electrolux Group Recalls Frigidaire Side by Side Refrigerators with Slim Ice Buckets Due to Choking and Laceration Hazards",
    "Date": "2/8/2024",
    "Summary": "This recall involves certain Frigidaire branded side by side refrigerators with Slim Ice buckets manufactured between 2015 and 2019, with model numbers DGHK2355TF, DGHX2655TF, FFSC2323TS, FGSC2335TD, FGSC2335TF, FGSS2635TD, FGSS2635TE, FGSS2635TF, FGSS2635TP, FPSC2277RF, FPSC2278UF, FPSS2677RF, LFSC2324VF, LGHK2336TD, LGHK2336TF, LGHX2636TD, and LGHX2636TF. Consumers can also visit https://www.frigidaire.com/en/frigidaire-recall-information to see if their specific serial number is included in this recall. The model and serial numbers are printed on a serial plate located inside the refrigerator compartment. Model numbers include: Model Numbers DGHK2355TF DGHX2655TF FFSC2323TS FGSC2335TD FGSC2335TF FGSS2635TD FGSS2635TE FGSS2635TF FGSS2635TP FPSC2277RF FPSC2278UF FPSS2677RF LFSC2324VF LGHK2336TD LGHK2336TF LGHX2636TD LGHX2636TF Color Guide The last letter of each model number denotes the various colors: F and S: Stainless Steel D: Dark Stainless Steel E: Black Painted P: White Painted",
    "Repair Number": 24110
  },
  {
    "Title": "VPR Brands Recalls Lighters Due to Missing Child Safety Feature, Posing Burn and Fire Hazards; Violation of the Federal Regulation for Cigarette Lighters",
    "Date": "2/8/2024",
    "Summary": "This recall involves Slim Soft and Slim Jet disposable lighters imported by VPR Brands. The products have \"DISSIM\" imprinted on one side and are 3.5 inches by 1 inch in size. They were sold in black, blue, clear, gray, red, white, and yellow colors, and have a molded circular grip at the bottom.",
    "Repair Number": 24111
  },
  {
    "Title": "GPU Angled Adapters Recalled Due to Fire and Burn Hazards; Manufactured by CableMod",
    "Date": "2/8/2024",
    "Summary": "This recall involves CableMod's 12VHPWR Angled Adapters, models V1.0 and V1.1, that plug into a graphics processing unit's power port at either a 90-degree or a 180-degree angle. Model V1.1 has a stabilizing pin on the side of the male connector. The adapters were sold in black, blue, gold, green, orange, pink, purple, red, silver, and white, and \"CableMod\" appears on the side of the adapter. The adapters came in two variations to accommodate power port orientation: Variation A and Variation B. The 90-degree angle adapter is \"L\" shaped: The V1.0 model measures about 36 mm long, 21mm wide and 21 mm deep; and the V1.1 model measures about 36 mm long, 21 mm wide and 22 mm deep. The 180-degree angle adapter is \"U\" shaped: The V1.0 model measures 41.5 mm long, 21 mm wide and 17.5 mm deep; and the V1.1 measures about 41 mm long, 21 mm wide and 20 mm deep.",
    "Repair Number": 24112
  },
  {
    "Title": "Husqvarna Recalls Grass Trimmers Due to Fire Hazard",
    "Date": "2/8/2024",
    "Summary": "This recall involves gas-powered Husqvarna Grass Trimmers with model numbers 330LK, 130C and 130L. The trimmers are orange and gray. \"Husqvarna\" and the model are printed on the motor housing. The SKU number is printed on the serial number tag on the bottom side of the motor housing. SKU numbers included in this recall are as follows: Model # SKU # 330LK 970514501 970514502 970514503 970514504 970545001 130C 970514301 970514302 970514303 970694601 970694701 130L 970514401 970514402 970514403 970694801 970694901",
    "Repair Number": 24113
  },
  {
    "Title": "Children's Bathrobes Recalled Due to Burn Hazard and Violation of Flammability Regulations; Sold by Nanchang Zhongcangjishi E-commerce",
    "Date": "2/8/2024",
    "Summary": "This recall involves two styles of 100% polyester hooded children's bathrobes; the dinosaur style in green, rose red and orange, and the shark style in blue, pink, yellow and gray. The bathrobes have attached belts and patch pockets. The size, manufacturer information and care instructions are printed on sewn-in labels inside the left inseam of the robes. They were sold in sizes 2-3 years, 3-5 years, and 6-8 years.",
    "Repair Number": 24114
  },
  {
    "Title": "Huihuang Trading Recalls Fishing Games Due to Magnet Ingestion Hazard, Violation of the Federal Safety Regulation for Toys; Sold Exclusively on Amazon.com",
    "Date": "2/1/2024",
    "Summary": "This recall involves Huihuang Trading Inc. Fishing Games. The game includes about nine animal pieces to fish with, in addition to four toy fishing rods, four toy fishing nets, a set of four markers, instructions to play the game, and a waterproof storage bag. Batch number X002903XZT323 is printed on the side of the game's box.",
    "Repair Number": 24096
  },
  {
    "Title": "DailySale Recalls High-Powered Magnetic Balls Due to Ingestion Hazard; Violation of the Federal Safety Regulation for Toy Magnet Sets",
    "Date": "2/1/2024",
    "Summary": "This recall involves 216-piece 5mm Magnetic DIY Balls Magic Cubes which are small, spherical, loose and separable neodymium rare-earth magnets with a strong magnetic flux. The 5mm-diameter magnets are sold in a set of colored magnetic balls. The recalled Magnetic Balls Magic Cubes were sold encased in a clear, plastic case and a tin storage box.",
    "Repair Number": 24097
  },
  {
    "Title": "Snap Recalls Lithium-Ion Battery Sold for Pixy Flying Cameras Due to Fire Hazard",
    "Date": "2/1/2024",
    "Summary": "This recall involves the rechargeable lithium-ion battery sold with the pocket-sized Pixy Flying Camera. The battery was sold separately and paired with the Pixy, which takes pictures and videos and measures about five inches long by four inches wide. The Pixy and battery are both yellow in color. The battery measures about three inches long and half of an inch wide.",
    "Repair Number": 24095
  },
  {
    "Title": "Lovevery Recalls Slide & Seek Ball Runs with Wooden Knobs Due to Choking Hazard",
    "Date": "2/1/2024",
    "Summary": "This recall involves certain units of the 2023 Slide & Seek Ball Runs, which are wooden toys with a plastic ball ramp that is included in Lovevery's Babbler Play Kits for children aged 13 to 15 months. The recalled units of the Ball Run have a wooden knob on the door, do not have a Lovevery logo engraved on the bottom, and do not have a green sticker on the inside wall of the door with the wooden knob.",
    "Repair Number": 24098
  },
  {
    "Title": "Meijer Recalls December Home Branded \"Candelabra\" Style Light Bulbs Due to Laceration Hazard",
    "Date": "2/1/2024",
    "Summary": "This recall involves December Home branded candelabra style incandescent replacement light bulbs. The light bulbs have a metallic threaded base and glass shell. December Home is printed on the product packaging. They were sold in packages of one, two or three light bulbs.",
    "Repair Number": 24099
  },
  {
    "Title": "Children's Nightgowns Recalled Due to Fire and Burn Hazard; Violation of Federal Flammability Regulations; Imported by Shenzhen Weite Information Technology Co., Ltd.; Sold Exclusively by Ekouaer at Amazon.com",
    "Date": "2/1/2024",
    "Summary": "This recall involves Ekouaer girl's nightgowns made of 95% cotton and 5% spandex, with a screen print on the chest. The nightgowns were sold in short sleeves in sizes 110, 120, 130, 140 and 150. The nightgowns were sold in the following 13 colors: clear blue, lilac, light blue, light green, light gray, gray, pink, navy, light pink, purple, rose, white and yellow.",
    "Repair Number": 24100
  },
  {
    "Title": "Children's Nightgowns Recalled Due to Fire and Burn Hazard; Violation of Federal Flammability Regulations; Regulations; Imported by Stripe and Stare",
    "Date": "2/1/2024",
    "Summary": "This recall involves Stripe & Stare branded children's 95% modal and 5% spandex blended nightgowns. The nightgowns are long-sleeved and have a ruffled collar, wrists and hemline. They were sold in children's sizes 1-2, 3-4, 5-6, 7-8 and 9-10 years and in Morning Bliss Pink print. The neck label states \"Stripe & Stare\" and the size designation. The inside seam label states \"95% modal and 5% elastance,\" and the care instructions.",
    "Repair Number": 24101
  },
  {
    "Title": "iFIT Recalls NordicTrack 50 LB iSelect Voice-Controlled Adjustable Dumbbells Due to Impact Hazard",
    "Date": "2/1/2024",
    "Summary": "This recall involves the iFIT NordicTrack 50 LB iSelect Voice-Controlled Adjustable Dumbbells, model NTSAW23020.0. The dumbbells were sold in black and include handles, weight plates, a tablet holder and a base. The dumbbells adjust from 5 to 50 pounds in 5-pound increments using an electronic motorized weight selector that responds to voice prompts or manual adjustment of a rotating knob located on the base. The dumbbells also include an integrated Bluetooth feature that communicates with the iFIT app to guide workouts and track data.",
    "Repair Number": 24102
  },
  {
    "Title": "SRAM Recalls Shift Brake Levers Due to Crash Hazard",
    "Date": "2/1/2024",
    "Summary": "This recall involves all SRAM 12-speed shift brake levers sold separately as upgrade or replacement kits. The hoods of the brake levers are black.",
    "Repair Number": 24103
  },
  {
    "Title": "Flat River Group Recalls Children's Bicycles Due to Crash and Injury Hazards; Violation of Federal Safety Regulations for Bicycles",
    "Date": "2/1/2024",
    "Summary": "This recall involves HolaBelle NextGen 10-inch, 12-inch, 16-inch and 20-inch children's bicycles. The bicycles were sold in black, blue, red, purple and pink. The NextGen logo is printed across either the top tube or down tube of the frame on the bikes.",
    "Repair Number": 24104
  },
  {
    "Title": "Box Components Recalls BMX Race Bicycle Stems Due to Fall Hazard",
    "Date": "2/1/2024",
    "Summary": "This recall involves BMX Race Box One Oversized 31.8 Delta bicycle stems used to clamp the fork steerer and/or handlebars. The recalled stems have dual-tone gray stripes, laser-etched at an approximate 45-degree angle on the stem body's sides. \"Boxone\" and the Box icon are also laser-etched on the stems. The stems were sold separately from bicycles. Bolts used in the stems are 6 mm in diameter and 20 mm in length. The stems were sold in various colors including black, red, blue, gold, purple and silver.",
    "Repair Number": 24105
  },
  {
    "Title": "The Museum of Modern Art Recalls Glass Little Wanderer Snow Globes Due to Laceration Hazard; Sold Exclusively at MoMA Design Stores",
    "Date": "2/1/2024",
    "Summary": "This recall involves glass snow globes, with a plastic artwork figurine \"Little Wanderer\" inside the snow globe. The snow globes measure 4.5 inches high x 3.3 inches wide with a wood base, and have a yellow, blue, or red figurine inside.",
    "Repair Number": 24106
  },
  {
    "Title": "BISSELL Recalls Multi Reach Hand and Floor Vacuum Cleaners Due to Fire Hazard",
    "Date": "2/1/2024",
    "Summary": "This recall involves BISSELL Multi Reach Hand and Floor Vacuum Cleaners models 1985, 19851 (also called Multi Auto), 19859, 1985T, 2151, 21512, 21513, 21517, 21518, 21519, 2151A, 2151T, 2151W, 2151V. \"Multi Reach\" is printed on the hand vacuum portion of the product. The vacuum cleaners were sold in a variety of colors. The model numbers are printed on the product rating label located behind the dirt tank. Note: Recalled lithium-ion batteries should be disposed of in accordance with any local and state ordinances, following the procedures established by your municipal recycling center for damaged/defective/recalled lithium batteries, because these potentially hazardous batteries must be handled differently than other batteries. Do not throw this recalled battery in the trash. Do not deposit this recalled battery in used battery recycling boxes found at various retail and home improvement stores.",
    "Repair Number": 24107
  },
  {
    "Title": "BRS Fuel Bottles Recalled Due to Risk of Burn and Poisoning; Violation of the Children's Gasoline Burn Prevention Safety Act Due to Lack of Child Resistant Closure; Sold Exclusively on Amazon.com by OAREA Outdoor Gear",
    "Date": "1/25/2024",
    "Summary": "This recall involves BRS Fuel Bottles, portable liquid fuel bottles sold in 530mL, 750mL and 1000mL sizes manufactured prior to July 2023. The bottles are orange with a black cap and white text. \"BRS,\" \"fuel bottle,\" and the bottle's volume warnings and/or directions appear in white lettering on the bottle's surface.",
    "Repair Number": 24090
  },
  {
    "Title": "Clark Associates Recalls Lancaster Table & Seating Brand Allegro Plastic Side Chairs Due to Fall Hazard",
    "Date": "1/25/2024",
    "Summary": "This recall involves Lancaster Table & Seating brand Allegro plastic side chairs for outdoor use. The chairs were sold in 14 different colors. Lancaster Table & Seating is stamped on the underside of the chairs. The chairs were sold in assembled form, constructed of glass reinforced polypropylene, and measure about 17 inches wide and about 33 inches in height. Model Color 427CRESINSBG Beige 427CRESINSBK Black 427CRESINSBL Stone Blue 427CRESINSBS Blush 427CRESINSCH Charcoal 427CRESINSOG Olive Green 427CRESINSOR Orange 427CRESINSPI Pistachio 427CRESINSRD Candy Red 427CRESINSSF Light Teal 427CRESINSSG Sangria 427CRESINSTL Teal 427CRESINSWH White 427CRESINSYL Marigold Yellow",
    "Repair Number": 24091
  },
  {
    "Title": "Pacific Cycle Recalls E-Bikes Due to Fire Hazard",
    "Date": "1/25/2024",
    "Summary": "This recall involves Ascend Cabrillo and Minaret Electric Bikes. The Ascend Cabrillo model numbers are R7583BPS and R7585BPS and the Ascend Minaret model number is R7586BPS. The model number and \"Pacific Cycle\" are printed on the service label located on the seat tube above the bottom bracket. The Ascend Cabrillo was sold in a sand or gray color and has a rear storage rack. The Minaret was sold in black with red and gray accents or a step-through frame style. The word \"Ascend\" is located on the downtube and the word \"Cabrillo\" or \"Minaret\" on the chain stay. The electric bikes have an electric assist motor.",
    "Repair Number": 24092
  },
  {
    "Title": "Yaomiao Children's Rhinestone Silver Tiaras Recalled Due to Violation of Federal Lead Content Ban; Sold Exclusively on Amazon.com by LordRoadS",
    "Date": "1/25/2024",
    "Summary": "This recall involves the rhinestone silver tiara with red rhinestones that was sold in a package with three other tiara styles that are not included in the recall, including blue, purple, and clear rhinestones. The four tiara styles were sold and shipped together in the same cardboard packaging marked \"Yaomiao\".",
    "Repair Number": 24093
  },
  {
    "Title": "Visual Comfort & Co. Recalls Maverick Coastal Outdoor Ceiling Fans Due to Impact Injury Hazard",
    "Date": "1/25/2024",
    "Summary": "This recall involves Visual Comfort & Co.'s Maverick Coastal 60-inch outdoor ceiling fans. The three-blade fans were sold in white and black finishes. Model number 3MGMR60XXX is printed on a white label located at the top of the fan motor.",
    "Repair Number": 24094
  },
  {
    "Title": "Home Design Recalls Upholstered Low Profile Standard and Platform Beds Due to Fall and Injury Hazards",
    "Date": "1/18/2024",
    "Summary": "This recall involves all Home Design Part number 80002 Tufted Upholstered Low Profile Standard Beds, Part number 80032 Tufted Upholstered Low Profile Standard Beds, Part number 80055 Tufted Upholstered Low Profile Standard Beds, Part number 80071 Tufted Upholstered Low Profile Platform Beds, and Part number 80053 Tufted Upholstered Low Profile Platform Beds. Part number 80002 is a gray, warm gray, or blue bed frame with standard supports requiring a box spring, available in twin, full, queen and king size. Part number 80032 is a gray or beige bed frame with standard supports requiring a box spring, available in twin, full, queen and king size. Part number 80055 is a silver gray, gray, or black bed frame with standard supports requiring a box spring, available in king size. Part number 80071 is a gray, beige, or black bed frame with platform supports which does not require a box spring, available in twin, full, queen or king. Part number 80053 is a warm gray bed frame with platform supports which does not require a box spring. Part number 80053 does not have a center support leg halfway along the side rail. The part number is provided in the installation manual and was printed on the packaging. The recalled bed frames have a law label on the back of the headboard.",
    "Repair Number": 24084
  },
  {
    "Title": "Bokser Home Recalls Mattress Pads Due to Fire Hazard and Violation of Federal Mattress Pad Flammability Regulation",
    "Date": "1/18/2024",
    "Summary": "This recall involves all sizes of Bokser Home 100% cotton mattress pads manufactured after October 2022. The quilted box stitch pattern mattress pads have a 100% cotton shell and fill. The retailer's name, manufacturer, and date of manufacture are printed on a label on the mattress pad.",
    "Repair Number": 24085
  },
  {
    "Title": "Steamist Recalls Wall-Mounted Tilt-Up Bath & Shower Seats Due to Fall and Laceration Hazards",
    "Date": "1/18/2024",
    "Summary": "This recall involves wall-mounted, folding shower seats made of teak wood slats joined together by support rods that extend from two wall-mounting brackets. The recalled Tilt-Up Bath & Shower Seats have model numbers SBS-101BN, SBS-101PN, SBS-101PC or SBS-101ORB and have brushed nickel, polished nickel, polished chrome or oil-rubbed bronze finishes on the support rods and bracket covers. The recalled Tilt-Up Bath & Shower Seats measure 20 inches wide by 13 inches deep.",
    "Repair Number": 24086
  },
  {
    "Title": "Alliance4Safety and 31 Furniture Companies Recall Millions of Plastic New Age Furniture Tip-over Restraint Kits Due to Tip-over and Entrapment Hazards to Children",
    "Date": "1/11/2024",
    "Summary": "This recall involves plastic New Age furniture tip restraint kits that were sold and distributed by various furniture companies with clothing storage units. Participating Furniture Companies American Drew American Woodcrafters Amini Innovation Corporation Ashley Furniture Industries, LLC Aspenhome Austin Group Furniture, LLC Avalon International Inc., LLC Bassett Furniture Industries, Inc. Drew and Jonathan by Hooker Furnishings Emery Park FD Home Corp. Flexsteel Industries, Inc. Furniture Values International, LLC Homelegance USA, LLC Hooker Furnishings Kincaid Furniture LC Direct Furniture Legacy Classic/Modern Furniture Liberty Furniture Industries, Inc. Magnussen Home Furnishings, Inc. New Classic Home Furnishings, Inc. Parker House Furniture Progressive Furniture Pulaski Furniture Riverside Furniture Samuel Lawrence Springhill Designs Standard Furniture Manufacturing Co., LLC Universal Furniture Van Thiel & Co. Vanguard Furniture Company. The New Age tip restraint kits included a plastic zip-tie, two brackets, and two screws and were sold with clothing storage units manufactured in Vietnam. The date of manufacture should be listed on a sticker or stamped on the clothing storage unit as November 2019 or later. The packaging of the recalled tip kits is white with black lettering and includes directions on how to anchor furniture. The bottom of the packaging states \"Manufactured by New Age Industries.",
    "Repair Number": 24078
  },
  {
    "Title": "Daikin Comfort Technologies Manufacturing (formerly Goodman Manufacturing Company L.P.) Expands Recall of Evaporator Coil Drain Pans to Include Additional Units",
    "Date": "1/11/2024",
    "Summary": "This recall expansion includes certain units manufactured between January 2019 and February 2020 that were incorrectly marked. DCT recently discovered that a limited number of evaporator coils that were manufactured during that time frame were incorrectly marked with a 2018 serial number, indicating that the unit was manufactured in 2018. The recall scope now includes about 3,600 additional units with the following configurations and coil serial numbers, as shown in the table below: Type Coil Configuration Affected Furnace Brands Affected Coil Serial Numbers Dates Sold Condensing furnace system Up-Flow (Coil above Furnace) All Prefixes ranging from 1901 through 2101 and certain prefixes ranging from 1811-1812 Jan. 2019 through Nov. 2021 Non-condensing furnace system (Certain configurations) Up-Flow (Coil above Furnace) Any \"competitor\" brand (excludes Goodman, Daikin or Amana branded furnaces) Prefixes ranging from 1901 through 2101 and certain prefixes ranging from 1811-1812 Jan. 2019 through Nov. 2021. NOTE: Furnace systems that were repaired with a new evaporator coil drain pan between January 2019 and November 2021, with the serial number range listed above, are also included in this recall. Whether a non-condensing furnace system falls within the scope of the recall depends on the location of the burners, which, if unknown, can be verified through DCT's model verification tool at: https://www.recallrtr.com/drainpan. Affected units can be identified through serial numbers found on the evaporator coil or the case, which sits atop the vertically installed furnace. The furnace brand and model number can be found on the furnace on the \"Energy Guide\" label. Consumers can refer to the instructions on Goodman's model verification tool at: https://www.recallrtr.com/drainpan. The model number of the outdoor condenser may also be required and can be found on a label attached to the product.",
    "Repair Number": 24080
  },
  {
    "Title": "Retrospec Recalls Kid's Bike Helmets Due to Risk of Head Injury; Violation of the Federal Safety Regulation for Bicycle Helmets",
    "Date": "1/11/2024",
    "Summary": "This recall involves Scout model Retrospec kid's bike helmets in sizes XS and S. The helmets were sold in the following colors and designs: Blippi, Blush, Brash Blue, Chameleon, Cool Mint, Matte Forest Green, Matte Black, Matte Navy, Matte White, Matte Burnt Orange, Matte Green, Matte Royal Blue, and Matte Whisper Pink. The helmets were sold with a green hang tag label listing the name \"Retrospec,\" the Scout brand name, and the helmet size. The word Retrospec or the Retrospec \"R\" logo appears on the right side of the helmet.",
    "Repair Number": 24081
  },
  {
    "Title": "Boot Royalty Recalls Men's Leather Work Boots Due to Crush Hazard",
    "Date": "1/11/2024",
    "Summary": "This recall involves the Men's Dark Brown Keaven WP Met Guard Work Boots with model SE4570 manufactured in July and August 2022. The recalled leather work boots are slip-on and look like cowboy boots. They have a metatarsal guard and a steel toe to protect the wearer's feet. The boots are tan and brown with decorative stitching on the uppers. The boots were sold in men's sizes 7 through 14. The boots have a red color label on the outsole that reads \"Justin\". \"Justin\" is also stamped into the leather near the outside heel of the product. The labels \"Steel Toe\" and \"Met Guard\" are sewn into the seam on the side of the products. A label heat transferred onto the inside of the top of the shaft of the boot includes the manufacturing date code of either 07/22 NH or 08/22 NH representing the month and year.",
    "Repair Number": 24082
  },
  {
    "Title": "UBBCARE Play Yard Mattresses Recalled Due to Suffocation Hazard for Infants; Violation of the Federal Safety Regulation for Crib Mattresses; Sold Exclusively on Amazon.com by UBBCARE",
    "Date": "1/4/2024",
    "Summary": "This recall involves UBBCARE play yard mattresses. The mattresses are 38 inches long and 26 inches wide. The play yard mattresses are white with a repeating quilted dot pattern on the mattress cover. There is a tag with the brand name as well as another tag with care instructions on the mattress.",
    "Repair Number": 24077
  },
  {
    "Title": "Bell Sports Recalls Bell Slope Adult Bicycle Helmets Due to Risk of Head Injury",
    "Date": "1/4/2024",
    "Summary": "This recall only involves Bell Slope adult bicycle helmets. The helmets were sold in dark green and light blue. The recalled Bell Slope helmets can be identified by the inner helmet sticker which has the model's name \"Slope\" and B1161X written on it. Only adult sized Bell Slope Helmets are affected by this recall.",
    "Repair Number": 24074
  },
  {
    "Title": "H.H. Brown Shoe Company Recalls Redeemer Work Boots Due to Injury Hazard",
    "Date": "1/4/2024",
    "Summary": "This recall involves Redeemer DH 5379 Men's 11\" Waterproof Metguard Comp Toe Ropers Work Boots with manufacturing codes VCJJ22, VCJC23, VCJD23 and VCJF23. They are pull-on boots with a brown leather upper decorated in a western style theme. They have a square toe, a one-inch heel, an EVA midsole and a metatarsal guard. The words \"Phantom Rider\" and \"Non-Metallic Toe\" are embossed in the outer side of the leather upper. The words \"Puncture Resisting Sole\" are embossed in the leather in the back of the boot. A black label stating \"Waterproof\" is sewn into a seam on the outer side of the boot. A white label on the inside of the boot includes the model number DH5379, the size and the manufacturing code. Only boots with manufacturing codes VCJJ22, VCJC23, VCJD23 and VCJF23 are included in this recall.",
    "Repair Number": 24072
  },
  {
    "Title": "Ride Aventon Recalls Sinch.2 Folding E-Bicycles Due to Crash and Injury Hazards",
    "Date": "1/4/2024",
    "Summary": "This recall involves Class 2 Sinch.2 electric bicycles. The folding, 500w e-bikes were sold in silver (quicksilver) and blue (sapphire.) The e-bike has front and rear tires and foldable handlebars. The name \"Aventon\" is printed on the side of the downtube of the e-bike frame and \"Sinch.2\" is printed on the chain stay that runs to the rear of the bicycle connecting the rear wheel to the frame.",
    "Repair Number": 24075
  },
  {
    "Title": "Homedics Recalls Massagers Due to Fire and Burn Hazards",
    "Date": "1/4/2024",
    "Summary": "This recall involves the HoMedics Therapist Select Massagers with model number HHP-715. The product has a 120 VAC, 60 HZ power cord. \"HoMedics\" is printed on the side of the barrel of the product. The products are black with a handle, housing and massage head attached to the end. The product has four interchangeable massage heads. Only manufacturing dates through the end of 2022 and prior are included in the recall. The manufacturing date is represented by a date code found on a sticker on the underside of the product's barrel. Date codes are a 4-digit number WWYY where WW is the sequential week of the year and YY is the last two digits of the manufacturing year. Only products with a YY of 20, 21 or 22 are subject to this recall.",
    "Repair Number": 24076
  },
  {
    "Title": "High-Powered Magnetic Balls Recalled Due to Ingestion Hazard; Sold Exclusively on Walmart.com through Joybuy",
    "Date": "12/28/2023",
    "Summary": "This recall involves 5mm magnetic balls which are small, spherical, loose and separable neodymium rare-earth magnets with a strong magnetic flux. The 5mm diameter magnets are sold in a set of 216 multi-colored magnetic balls. The recalled Relax Magnetic Balls were sold encased in a clear, plastic case and a portable, tin storage box. The set includes a black storage bag.",
    "Repair Number": 24071
  },
  {
    "Title": "BlendJet Recalls 4.8 Million BlendJet 2 Portable Blenders Due to Fire and Laceration Hazards",
    "Date": "12/28/2023",
    "Summary": "This recall involves BlendJet 2 Portable Blenders sold in a variety of colors and designs. Serial numbers are printed on the bottom of the base along with \"blendjet2\" and \"The Original Portable Blender.\" The blenders measure approximately 9.5 inches in height and 3 inches in width and weigh approximately 1.5 pounds. Units where the first 4 digits of the serial number are between 5201-5542 and are subject to the recall must be identified through the use of the \"Is my BlendJet 2 Recalled?\" tool located at www.blendjet.com/safetyandrecall.",
    "Repair Number": 24069
  },
  {
    "Title": "FNA Group Recalls Simpson Pressure Washers Due to Burn Hazard; Sold Exclusively at Lowe's",
    "Date": "12/28/2023",
    "Summary": "This recall involves Simpson Gas Pressure Washers with model number PS61264. The pressure washers are black in color. The Simpson logo, \"Pro Series\" and 4400 PSI are printed on the handle of the unit. The model number is printed on a silver label on the unit's frame.",
    "Repair Number": 24070
  },
  {
    "Title": "Brandline Recalls HEAO High Chairs Due to Risk of Suffocation, Entrapment and Laceration Hazards; Violation of the Federal Safety Standards; Sold Exclusively on Amazon.com",
    "Date": "12/21/2023",
    "Summary": "The recall involves HEAO's 4-in-1 high chairs. The adjustable height and multiple recline positions high chairs were sold in black, blue, gold, green, gray, pink and red. They have a footrest, a detachable tray, seat cushion, and four static or rotating wheels with locks. \"HEAO\" is on the high chair's head support of the seat cushion and on the front of the tray. \"Max Lead Int'l Ltd. 3113 Glenfield Ave., Dallas, TX 75233 (302) 448-4207\" is printed on a label stitched on the back of the seat cushion.",
    "Repair Number": 24064
  },
  {
    "Title": "DGL Group Recalls Hover-1 Helix Hoverboards Due to Fire Hazard",
    "Date": "12/21/2023",
    "Summary": "This recall involves certain Hover-1 Helix hoverboards. The recalled hoverboards have serial numbers containing 15914, 19203, or 19988 as the fifth code in the six-code serial number affixed to the bottom of the board. The hoverboards were sold in camouflage and galaxy colors. \"Hover-1\" is printed on the front of the hoverboard. The model \"Hover-1 Helix\" and the serial number are printed on separate labels on the bottom of the hoverboard.",
    "Repair Number": 24065
  },
  {
    "Title": "FeraDyne Outdoors Recalls Rhino Tree Stands Due to Fall Hazard",
    "Date": "12/21/2023",
    "Summary": "This recall involves the Treestand Safety Harness with model numbers RTH-2000S and RTH-2001S which were sold as part of Rhino Tree Stands/Ladder Stands that have model numbers: RTH-100, RTH-200, RTL-100, RTL-200, RTL-300, RTL-400, RTL-1000, RTL-3000 and RTL-4000. The recalled tree stands safety harnesses have black cloth strips with a white cloth tether stitched together with orange thread. The safety harness model number is printed on a label included with each harness that says \"RTH-2000S\" or \"RTH-2001S\". This safety harness was included in the box of the following tree-stand/ladder-stand products. Model # Description RTH-100 Hang on the stand RTH-200 Hang on the stand with shooting rail RTL-100 16-foot ladder stand RTL-200 16-foot ladder stand RTL-300 18-foot ladder stand RTL-400 22-foot ladder stand RTL-1000 18-foot ladder stand RTL-3000 17.5-foot XL ladder stand RTL-4000 17.5-foot ladder stand",
    "Repair Number": 24066
  },
  {
    "Title": "Klein Tools Recalls Blackfire and Klein Tools Power Stations Due to Fire and Burn Hazards",
    "Date": "12/21/2023",
    "Summary": "This recall involves Klein Tools and Blackfire portable rechargeable power stations with lithium-ion batteries. The portable power charging stations deliver up to 1500W of AC power. They contain a built-in 983Wh lithium-ion battery pack. The power stations have four 120V outlets, six USB ports and a 12V car port. The model names PAC1000 (Blackfire) and KTB1000 (Klein Tools) can be found on the label located at the rear of the power station. The power stations are orange and black with \"Klein Tools\" on the front in white lettering.",
    "Repair Number": 24067
  },
  {
    "Title": "TJX Recalls Foldable Wood and Rope Bistro Set Chairs Due to Fall Hazard",
    "Date": "12/21/2023",
    "Summary": "This recall involves foldable wood and rope bistro set chairs sold as part of a three- or five-piece set. Some of the sets were sold under Nautica or House & Garden brands. The folding chair sets consist of one small wooden table and two or four foldable chairs made with wood frames, and rope on the seat and back in either gray, turquoise, brown, sand, black, aqua, pink, green, taupe or white, and a gold bar supporting the back legs. Some chairs were sold individually at stores. The chairs were also sold online labeled as three-piece handcrafted in Vietnam and three-piece HD Furniture Group indoor-outdoor rope and Acacia Wood Bistro Table and Chairs Set.",
    "Repair Number": 24068
  },
  {
    "Title": "Pella Recalls Casement Windows Due to Injury Hazard (Recall Alert)",
    "Date": "12/21/2023",
    "Summary": "This recall involves Pella's Architect Series venting wood and aluminum-clad casement windows. The following four custom-made casement window types are included in this recall: all venting hurricane impact products with side pivot hardware, all venting casements with a frame height greater than 96 inches, all venting casements with a frame width wider than 35 inches, and all venting casements with a frame width greater than 29 inches and a vent height greater than 47 inches with side pivot hardware. The serial number is etched in a lower corner of the window glass. Serial numbers included in this recall can be verified at www.PellaHingeRecall.expertinquiry.com.",
    "Repair Number": 24732
  },
  {
    "Title": "Litti City and Litti Pritti Dress-up Playsets and Prextex Slime Eggs Recalled Due to Violations of Federal Phthalates and Lead Content Bans; Imported by Perch, Amusty and Bingo Deals (Recall Alert)",
    "Date": "12/21/2023",
    "Summary": "This recall involves two Litti City dress-up playsets, one Litte Pritti dress-up playset and Prextex-branded DIY take-along slime eggs. The Litti City premier doctor playset (Amazon ASIN B07WMX25SV) consists of a white doctor outfit and accessories, including blue glasses, yellow stethoscope and bandages, and a book. The Litti City teacher purse playset (Amazon ASIN B08MB3CJD6) consists of a green purse and accessories, including glasses, markers, rules, eraser, hall passes, learning charts and stickers. The Litti Pritti handbag playset (Amazon ASIN B06XQXMQFD) includes a pink purse, wallet, make-up, keys and cell phone. The 12 clear plastic slime eggs are filled with slime in varying colors and come in a blue plastic egg container with www.prextex.com embossed on the top. The set includes seven mini bottles of shaped beads and 12 straws.",
    "Repair Number": 24737
  },
  {
    "Title": "Vornado Expands Recall to Include Additional 1.75 Million Steamfast Travel Steam Irons Due to Fire, Burn and Shock Hazards",
    "Date": "12/14/2023",
    "Summary": "This recall expansion involves all Steamfast brand Home and Away Travel Steam Irons with model numbers SF-717, SF-720 and SF-727. The model numbers are printed on the back of the irons. Steamfast is printed on the white irons.",
    "Repair Number": 24050
  },
  {
    "Title": "Empower Brands Recalls Power XL Dual Basket Air Fryers Due to Burn Hazard",
    "Date": "12/14/2023",
    "Summary": "This recall involves two models of the PowerXL dual-basket air fryer. The egg-shaped air fryers have two baskets that can be used separately or optionally combined into one large single basket. The recalled air fryers were sold in black or cinnamon colors. The 10-quart DUAF-10 model is about 17 inches long by 16 inches wide by 12 1/2 inches tall, and weighs about 14 1/2 pounds. The 9-quart DUAF-005 model is about 14 inches long by 13 inches wide by 15 inches tall, and weighs about 14 pounds. The product has a silver label on the front that says \"PowerXL\". There is a white label on the bottom of each unit or on the unit's power cord that lists the model number.",
    "Repair Number": 24051
  },
  {
    "Title": "Polaris Industries Recalls Ranger XP Kinetic Recreational Off-Road Vehicles (ROVs) Due to Crash Hazard",
    "Date": "12/14/2023",
    "Summary": "This recall involves Model Year 2023-2024 RANGER XP Kinetic vehicles. The vehicles were sold in the following colors: camouflage and white. They were sold in three-seat configurations and have \"POLARIS\" stamped on the front grille. The model number and VIN are printed on a portion of the left rear frame (on the driver's side of the vehicle) under the cargo box.",
    "Repair Number": 24055
  },
  {
    "Title": "Polaris Industries Recalls RZR 200 Youth Recreational Off-Road Vehicles (ROVs) Due to Crash Hazard and Risk of Serious Injury",
    "Date": "12/14/2023",
    "Summary": "This recall involves certain VINs of Model Year 2021-2024 RZR 200 youth vehicles. The vehicles were sold in the following colors: blue, gray and white. POLARIS is stamped on the front grille and POLARIS and RZR are printed on the sides of the vehicles. The model name is also printed on the side of the chassis. The VIN is stamped on a plate riveted to the upper frame rail visible from the right rear wheel well.",
    "Repair Number": 24056
  },
  {
    "Title": "Savvy Rest Recalls Quilted Cotton Mattress Pads Due to Fire Hazard and Violation of Federal Mattress Pad Flammability Standard",
    "Date": "12/14/2023",
    "Summary": "This recall involves Savvy Rest quilted cotton mattress pads. The white mattress pads have unbleached cotton ticking and corner ties. The pads were sold in sizes twin, twin XL, full, queen, king, and California king. No label is attached to the pads. This recall only includes the quilted cotton mattress pads.",
    "Repair Number": 24058
  },
  {
    "Title": "Room & Board Recalls Griffin Duo Bunk Beds Due to Risk of Collapse, Fall and Injury Hazards; Sold Exclusively at Room & Board",
    "Date": "12/14/2023",
    "Summary": "This recall involves Room & Board's Griffin Duo Bunk Beds. The bunk beds are made from cherry wood or maple wood and have a label on the footboard that identifies the product as the Griffin Duo Bunk Bed.",
    "Repair Number": 24060
  },
  {
    "Title": "Traeger Pellet Grills Recalls Flat Top Propane Grills Due to Fire Hazard",
    "Date": "12/14/2023",
    "Summary": "This recall involves the Traeger Flatrock Flat Top Grills powered by propane. The product is black in color and has a closeable lid with a silver handle and the name \"Traeger\" written on it in black with the Traeger logo. The product is approximately 74 inches long by 27 inches wide by 36 inches tall and weighs about 189 lbs. The grills have a silver color label located on the rear with SKU Number as 1DFL42LLA.",
    "Repair Number": 24061
  },
  {
    "Title": "Weatherbeeta USA Recalls Collegiate Horse-Riding Saddles Due to Injury Hazard (Recall Alert)",
    "Date": "12/14/2023",
    "Summary": "This recall involves nine models of Collegiate English horse-riding saddles: Degree Mono Event, Graduate Close Contact, Honour Close Contact, Integrity Mono Dressage, Lectern Dressage and Warwick Close Contact. All of the saddles are branded Collegiate and have a Collegiate nail head in the head of the saddle and Collegiate brand printed on the stirrup keeper. The saddles measure between 15 and 18 inches and were sold in black or brown leather or synthetic depending on the model. All Lectern saddles are included in this recall. For all other models, only saddles manufactured between March 2019 through July 2023 are included in this recall. The manufacturing date, in MM-YYYY format, is the last six digits of the serial number. The serial number is stamped on the underflap of the saddle, below \"Made in India.",
    "Repair Number": 24734
  },
  {
    "Title": "BRP US Recalls Side-By-Side Vehicles Due to Injury Hazard (Recall Alert)",
    "Date": "12/14/2023",
    "Summary": "This recall involves Model Year 2022 and 2023 Can-Am Commander series, Defender series, Maverick Trail series equipped with an HD7 or 700 engines side-by-side vehicles with model number model year 2022 and 2023. The vehicles were sold in various colors. The brand and model name are on the vehicle's sides.",
    "Repair Number": 24735
  },
  {
    "Title": "Kubota Tractor Recalls Utility Vehicles Due to Crash and Collision Hazards (Recall Alert)",
    "Date": "12/14/2023",
    "Summary": "This recall involves Kubota Utility Vehicles with model number RTV-XG850, known as the \"Sidekick.\" \"Sidekick\" and/or the model number are on the side of the utility vehicles, which were sold in various colors. Data plates on the side of the recalled vehicles have the model number and serial numbers ranging from 31706-35058, Y1025-Y1310, 50011-50012, and 50075-52920.",
    "Repair Number": 24736
  },
  {
    "Title": "XpressGoods Recalls High-Powered Magnetic Balls Due to Ingestion Hazard; Failure to Meet Federal Safety Regulation for Toy Magnet Sets",
    "Date": "12/7/2023",
    "Summary": "This recall involves 5mm Neodymium Magnetic Balls which are small, spherical, loose, and separable neodymium rare-earth magnets with a strong magnetic flux. The 5mm diameter magnets are sold in a set of multi-colored magnetic balls. The recalled Neodymium Magic Magnetic Balls were sold encased in a clear, plastic case and a tin storage box.",
    "Repair Number": 24048
  },
  {
    "Title": "Oreck Discover Upright Vacuums Recalled by TTI Floor Care Due to Electrical Shock Hazard",
    "Date": "12/7/2023",
    "Summary": "This recall involves models UK30500 and UK30500PC of the Oreck Discover Upright Vacuum. Impacted vacuums also have serial numbers that begin with AJ2226, AJ2227, AJ2228, AJ2229, AJ2230, AJ2231, and AJ2232. The model and serial number are printed on a silver data label on the bottom of the vacuum. The vacuum is silver and black with \"Oreck\" and \"Discover\" printed on the front.",
    "Repair Number": 24039
  },
  {
    "Title": "Security Equipment Recalls SABRE Aim & Fire Pepper Gel Spray Canisters Due to Failure to Operate in an Emergency",
    "Date": "12/7/2023",
    "Summary": "This recall involves SABRE Aim & Fire Pepper Gel with Training Canisters with model number SDP-G-03. The canisters look like a toy gun and have a black handle with an orange body. Only units with the expiration date of 9/2027 are included in the recall. The expiration date can be found on the white label on the side of the canisters.",
    "Repair Number": 24040
  },
  {
    "Title": "Nap Queen Maxima Hybrid Mattresses Recalled by Adven Group Due to Fire Hazard; Violation of Federal Flammability Standard",
    "Date": "12/7/2023",
    "Summary": "This recall involves all sizes of the Nap Queen 12-inch Maxima Hybrid of Cooling Gel Memory Foam and Bonnell Spring Mattress, including model numbers NQIH12KK, NQIH12QQ, NQIH12FF, NQIH12TT and NQIH12TX. The mattress is single-sided and has white with gray-dotted fabric ticking, a dark gray 4-inch mesh stripe and wave quilted pattern on the sides, and a straight-line quilted pattern on the top of the mattress. The tape edges are white and gray striped. On the mattress label, sewn into the cover, is the model name \"Maxima\" with the model number and \"Imported by Adven Group, LLC.\" The mattresses were sold compressed in a box.",
    "Repair Number": 24041
  },
  {
    "Title": "Mary Meyer Recalls Bubba Bull Plush Toys Due to Choking Hazard",
    "Date": "12/7/2023",
    "Summary": "This recall involves certain Bubba Bull (Style 45541) Plush Toys with date code 1945. The date code is printed on a white tag on the plush toys. The plush stuffed toys are brown with off-white bull horns and Mary Meyer is printed on the seam label.",
    "Repair Number": 24042
  },
  {
    "Title": "Wet & Forget USA Recalls 2.7 Million Bottles of \"Xtreme Reach\" Outdoor Mold & Mildew Stain Remover with Hose End Nozzle Due to Risk of Skin and Eye Irritation",
    "Date": "12/7/2023",
    "Summary": "This recall involves the nozzles on Wet & Forget \"Xtreme Reach\" Outdoor Mold & Mildew Stain Remover (48 oz. & 68 oz.) bottles with hose end nozzles. The stain remover is sold in a blue plastic bottle and has UPCs 879288000077 (48 oz.) and 879288000084 (68 oz.) printed on the back of the bottle in the bottom right-hand corner of the label. \"Wet & Forget\" is written on the hose end nozzle.",
    "Repair Number": 24043
  },
  {
    "Title": "Sourceone Ventures Recalls Windsor Queen Xtrabed™ Due to Injury and Tip Over Hazards; Sold Exclusively at Wayfair",
    "Date": "12/7/2023",
    "Summary": "This recall involves the Windsor Queen Xtrabed Mobile Murphy Bed. The bed was sold in white, brown and gray colors. When in the closed and stored position, it measures about 62 inches wide and 47 inches tall and has the appearance of drawers. When opened in the bed position, it measures about 62 inches wide and 82 inches long. Recalled models have a manufactured date prior to May 2022. These models do not have a notch in the small tray of the bed, which is visible when opened.",
    "Repair Number": 24047
  },
  {
    "Title": "Primark Recalls Baby Rattles Due to Risk of Choking and Ingestion Hazards",
    "Date": "12/7/2023",
    "Summary": "This recall involves the Primark baby rattles, \"Wooden Music Shaker\" and \"DTR M&M Maracas\". The baby rattles were sold in yellow, red, light green and light blue colors. The red baby rattle has a \"Minnie Mouse\" image on it, and the yellow baby rattle has a \"Mickey Mouse\" image on it. The numbers 7495201 (Wooden Music Shaker) or 5311101 (DTR M&M Maracas) are printed on the product packaging.",
    "Repair Number": 24049
  },
  {
    "Title": "Segway Powersports Recalls 2022 Fugleman UT10E and UT10X Utility-Terrain Vehicles Due to Fire Hazard (Recall Alert)",
    "Date": "12/7/2023",
    "Summary": "This recall involves model year 2022 Fugleman Utility -Terrain Vehicles (UTVs) with model numbers UT10E or UT10X. These vehicles were sold in various colors including white, black, gray and camo. \"FUGLEMAN\" decals are printed on the right and left rear side panels. The Segway logo is on the hood. The model number is located on the right and left rear side panels next to the Fugleman logo.",
    "Repair Number": 24727
  },
  {
    "Title": "Ergodyne Recalls Squids Wire Tool Attachments with Screw Gate Tool Tails Due to Injury Hazard (Recall Alert)",
    "Date": "12/7/2023",
    "Summary": "This recall involves the Squids 3705 Wire Tool Attachments - Screw Gate Tool Tail. The product is used to securely tether tools to prevent them from falling on those below while working at heights. It has a 5 ¾-inch-long orange wire loop with a black and green tag. \"Ergodyne\" and \"Model 3705\" are printed on the black front tag. The back of the tag is green. They were sold in packs of six or sold as part of kits numbered 3170, 3183, 3188, and 3189. This recall only applies to model number 3705.",
    "Repair Number": 24728
  },
  {
    "Title": "Vibe Bear Playyard Mattresses Recalled Due to Suffocation Hazards for Infants; Violation of the Federal Safety Regulation for Crib Mattresses; Sold Exclusively on Amazon.com by Vibe Bear (Recall Alert)",
    "Date": "12/7/2023",
    "Summary": "This recall involves Vibe Bear portable playyard mattresses, manufactured on or after August 15, 2022. The mattresses are white with a diagonal quilted surface and contain graphics of paintbrushes, paints and nature imagery printed on them. They measure about 38 inches long by 26 inches wide by 3 inches high, and have a dark blue tag hanging off the mattress with a picture of a cartoon teddy bear. The mattresses fold in half and have a large crease going down the length of the mattress in the middle where they fold. Model number YX-B17 and the date of manufacture, in YYYY.MM, can be found on a tag on the edge of the mattress.",
    "Repair Number": 24729
  },
  {
    "Title": "Bugaboo Recalls Dragonfly Seat Strollers Due to Injury Hazard (Recall Alert)",
    "Date": "12/7/2023",
    "Summary": "This recall involves only the seat sold with the Bugaboo Dragonfly Seat Strollers. The strollers are comprised of a base on which either a seat or bassinet can be mounted. The seat measures approximately 11.8 inches wide and 22.8 inches long and comes in either black, gray or forest green. Only units with serial numbers beginning with the following numbers are included in the recall: S46012302xxxxxx S46012303xxxxxx S46012307xxxxxx S460123010xxxxx S460123013xxxxx S460123015xxxxx S46012320xxxxxx The serial number for the seat can be found on a label affixed to the underside of the seat and on a label affixed to the underside of the chassis of the stroller. Consumers can check to see if their unit is included in the recall checking the serial number at https://service.bugaboo.com/s/dragonfly-seat-replacement.",
    "Repair Number": 24730
  },
  {
    "Title": "Moonsea Pack and Play Mattresses Recalled Due to Suffocation Hazard for Infants; Violation to the Federal Safety Regulation for Crib Mattresses; Sold Exclusively on Amazon.com by Moonseasleep (Recall Alert)",
    "Date": "12/7/2023",
    "Summary": "This recall involves Moonseasleep pack and play mattresses. The mattresses are 37.5 inches long and 26 inches wide, are white and fold in a tri-fold pattern. The top of the mattress has a repeating diamond pattern. There is a small tag on the mattress with the date code in the format DD.MM.YYYY on it. The date codes from 15/08/2022 to 23/08/2023 are involved in this recall. The mattresses came folded in a black canvas bag with the brand \"MOONSEA\" printed on it.",
    "Repair Number": 24731
  },
  {
    "Title": "Bunkhouse and Lotsa LITES! Mini String Lights Recalled Due to Burn and Fire Hazards; Imported by DM Merchandising (Recall Alert)",
    "Date": "12/7/2023",
    "Summary": "This recall involves Bunkhouse and Lotsa LITES! Connectable Mini String Lights. The recalled lights are a nine-foot strand of 20 LED clear bulbs with white light, for use with batteries and/or USB input. They were sold in three different packages: Everyday (SKU: BHSTL24) Christmas (SKU: XSTL24) and Halloween (SKU: HSTL24) The SKU number can be found on the back of the packaging.",
    "Repair Number": 24733
  },
  {
    "Title": "Foiresoft Zebra Roller Blinds Recalled Due to Strangulation and Entanglement Hazards; Sold Exclusively on Amazon.com by Softfunch (Recall Alert)",
    "Date": "12/5/2023",
    "Summary": "This recall involves Foiresoft Basic Zebra Roller Blinds sold exclusively on Amazon.com. The roller blinds were sold in multiple colors with sizes ranging from width 10-110 inches, and height 64 inches. Foiresoft is printed on the label sticker on the headrail.",
    "Repair Number": 24726
  },
  {
    "Title": "Russound Recalls AW70V6 Loudspeakers Due to Impact Injury Injury Hazard",
    "Date": "11/30/2023",
    "Summary": "This recall involves the Russound Model AW70V6 loudspeakers, designed primarily for use with commercial audio systems that use 70V or 100V speaker wiring, but they can also be used in residential applications. All products with the model number AW70V6 are included in this recall. The speakers have a label attached to the rear of each AW70V6 loudspeaker with \"Russound\", the model number, and 70V/100V. The speakers measure 12-1/6 inches high by 8-1/2 inches wide by 9-1/2 inches deep and were sold in white or black colors.",
    "Repair Number": 24032
  },
  {
    "Title": "GE Appliances, a Haier Company, Recalls Electric Cooktops Due to Burn Hazard",
    "Date": "11/30/2023",
    "Summary": "This recall involves GE-branded JP3030 knob-controlled electric radiant cooktops manufactured from July 2022 through September 2022 with serial numbers beginning with prefixes LT, MT, RT or ST. The recalled cooktops have black or white glass cooktop surfaces and have four radiant burners with four corresponding \"Hot Cooktop\" lights and four burner control knobs located on the right side of the cooking surface. The following model numbers, UPC codes, and serial number prefixes are included in this recall: Model Number UPC Code Serial Number or Serial Number Prefix JP3030DJ4BB 084691809609 LT081195Q - LT081286Q MT- RT- ST- JP3030SJ4SS 084691809074 LT015466Q - LT015467Q LT048419Q - LT048420Q LT073851Q LT129159Q - LT129183Q MT- RT- ST- JP3030TJ4WW 084691809081 LT148064Q - LT148068Q LT118335Q MT- RT- ST- The model number, UPC code, and serial number of the cooktops are printed on the permanent on-product label located on the bottom of the unit, close to the front left burner location.",
    "Repair Number": 24033
  },
  {
    "Title": "Berkshire Blanket & Home Company Recalls Heated Throws and Blankets Due to Fire and Thermal Burn Hazards",
    "Date": "11/30/2023",
    "Summary": "This recall involves Berkshire Blanket Heated Throws and Blankets sold in a variety of colors and patterns, including blue, cream, gray, hummus, striped blue and snowflake. The throws and blankets sold at L.L. Bean are L.L. Bean and Berkshire Blanket branded. The throws and blankets sold at Army and Air Force Exchange Service (AAFES) stores and online at berkshireblanket.com, amazon.com, target.com, macys.com and qvc.com are Berkshire Blanket branded. The throws measure about 50 inches wide and 60 inches long and are made of polyester. The blankets are sized to fit twin-, full/queen- and king-sized beds and are made of polyester. The heated throws and blankets are controlled by a white cord with a white digital controller unit. The model numbers are on a white label on the back of the throws and blankets and on the back side of the controller unit. The Berkshire Blanket logo and tracker numbers are printed on the wash label affixed to the throws and blankets. The tracker numbers subject to this recall fall within the following range: Tracker Number Range Berkshire Blanket Heated Throws 05012218641-06302218641 05012218642-06302218642 05012218806-06302218806 05012218807-06302218807 05012218828-06302218828 05012218811-06302218811 05012218809-06302218809 05012218810-06302218810 050122E0551-063022E0551 050122E0549-063022E0549 Berkshire Blanket Heated Blankets 050122E0545-063022E0545 050122E0546-063022E0546 050122E0550-063022E0550 050122E0544-063022E0544",
    "Repair Number": 24034
  },
  {
    "Title": "Specialized Bicycle Components Recalls Supacaz Brand Orbitron Pedals Due to Fall Hazard (Recall Alert)",
    "Date": "11/30/2023",
    "Summary": "This recall involves Supacaz Orbitron bicycle pedals. The pedals are replaceable, low-profile and made of alloy. They were sold in oil slick multicolor and measure about eight inches long and four inches wide.",
    "Repair Number": 24718
  },
  {
    "Title": "Peg Perego Recalls Inclined Sleeper Bassinets for YPSI and Z4 Strollers Due to Risk of Suffocation and Fall Hazard; Violation of Federal Safety Standards (Recall Alert)",
    "Date": "11/30/2023",
    "Summary": "This recall involves compact bassinets that were sold individually or as an accessory to the Peg Perego YPSI and Z4 stroller systems. The bassinets have a zip-on boot, insert pad and a foldable canopy. The Z4 bassinets have an \"Agio\" label on the side of the canopy. Only bassinets manufactured on or after June 23, 2022 are included in this recall. The manufacture date in YYYY/MM/DD format and model number are located in the hood/head area of the bassinet and can be found by lifting the bassinet's pad/cushion and internal lining. The YPSI and Z4 bassinets were sold in the following colors and model numbers, located beneath the date code: Model Name Color Peg Perego Color Name Model Number YPSI Bassinet Black Onyx IN0800NA00S013DX13 Pink-beige Mon Amour IN0800NA00BA36 Gray Atmosphere IN0800NA00MF53DX53 Gray City Gray IN0800NA01BA53 Blue New Life IN0800NA00DS41RS41 Black and gold Graphic Gold IN0800NA00AB50RO01 Z4 Bassinet Blue Agio Mirage IN0800BX00BA71 Gray-brown Agio Gray IN0800BX00BA53 Black-brown Agio Black IN0800BX00BA13 Black Black Pearl IN0800BX00BA13PL63",
    "Repair Number": 24719
  },
  {
    "Title": "Polaris Recalls Patriot 9R MATRYX PRO RMK and Patriot 9R MATRYX RMK KHAOS Snowmobiles Due to Injury Hazard (Recall Alert)",
    "Date": "11/30/2023",
    "Summary": "This recall involves Polaris Model Year 2023 PATRIOT 9R MATRYX PRO RMK and PATRIOT 9R MATRYX RMK KHAOS. The recalled snowmobiles were sold in black and custom color combinations. \"POLARIS\" is stamped on the front side paneling of the vehicles. The VIN and model number are located on the right side of the vehicle's frame.",
    "Repair Number": 24720
  },
  {
    "Title": "Vibe Bear Playyard Mattresses Recalled Due to Suffocation Hazards for Infants; Violation of the Federal Safety Regulation for Crib Mattresses; Sold Exclusively on Amazon.com by Beyond Baby (Recall Alert)",
    "Date": "11/30/2023",
    "Summary": "This recall involves Beyond Baby Vibe Bear-branded portable playyard mattresses, manufactured on or after August 15, 2022. The mattresses are white with a diagonal quilted surface and graphics of green and yellow trees, houses and foxes printed on them. They measure about 38 inches long by 26 inches wide by 3 inches high and have a dark blue tag hanging off the mattress with a picture of a cartoon teddy bear. The mattresses fold in half and have a large crease going down the length of the mattress in the middle where it folds. Model number YXB17 and the date of manufacture, in YYYY.MM, can be found on a tag on the edge of the mattress.",
    "Repair Number": 24721
  },
  {
    "Title": "Polaris Recalls Patriot 850 MATRYX Snowmobiles Due to Injury Hazard (Recall Alert)",
    "Date": "11/30/2023",
    "Summary": "This recall involves certain VINs of Polaris Model Year 2022 Patriot 850 MATRYX RMK, INDY and SWITCHBACK with electric start snowmobiles. In addition, this recall involves primary (drive) clutches sold as service parts with part number 1323613 (e-start). The recalled snowmobiles were sold in black and custom color combinations. \"POLARIS\" is stamped on the front side paneling of the vehicles. The VIN and Model Number are located on the right side of the vehicle's frame.",
    "Repair Number": 24722
  },
  {
    "Title": "Pack and Play Mattresses Recalled Due to Suffocation Hazard for Infants; Violations to the Federal Safety Regulation for Crib Mattresses; Sold Exclusively on Amazon.com by DODO Baby House (Recall Alert)",
    "Date": "11/30/2023",
    "Summary": "This recall involves DODO Baby House pack and play mattresses with model number YX-04. The date of manufacture can be found on a tag on the edge of the mattress. There is also a small dark blue tag on the mattress with a cartoon teddy bear holding a ball. The date of manufacture is in the format \"YYYY.MM\" representing year and month. Only mattresses manufactured on or after August 15, 2022 are included in the recall. The crib mattresses are 38 inches long and 26 inches wide. The top and bottom of the pack and play mattresses are light blue with white triangles printed on it.",
    "Repair Number": 24723
  },
  {
    "Title": "Tiblue Stainless Steel Children's Cups Recalled Due to Violation of Federal Lead Content Ban; Sold Exclusively on Amazon.com by FENGM (Recall Alert)",
    "Date": "11/30/2023",
    "Summary": "This recall involves 8 oz and 12 oz models of Tiblue Double-Walled Stainless Steel Children's Cups sold in pairs. Both sizes of the recalled cups were sold in 11 different color combinations, including a matching straw: Pink+Purple, Blue+Green, Turqouise+Magenta, Coral+Indigo, Lemon+Mint, Gray+Slate, Mint+Blush, Lilac+Baby Blue, Rainbow+Mermaid, Dinosaur+Shark, Unicorn+Dinosaur. \"Tiblue\" is printed on the front bottom of the cups.",
    "Repair Number": 24724
  },
  {
    "Title": "Klickpick Home Recalls Stainless Steel Children's Cup Sets Due to Violation of Federal Lead Content Ban; Sold Exclusively at Amazon.com (Recall Alert)",
    "Date": "11/30/2023",
    "Summary": "This recall involves 8 oz and 12 oz Klickpick Home stainless steel children's cups sold in sets of two and four. The sets of two 8 oz and 12 oz cups were sold in 6 different color combinations: black/white, gray/blue, pink/teal, purple/green, aqua blue/green and peach/pink. The sets of four 8 oz and 12 oz cups were sold in 3 color combinations: black/white/gray/blue, pink/teal/purple/green and aqua blue/green/peach/pink. The cups have a matching silicone straw, a spill-proof lid and one straw brush. \"KPH\" is printed on the front bottom of the cups.",
    "Repair Number": 24725
  },
  {
    "Title": "Balloon Time Mini Helium Tanks Recalled by Worthington Industries Due to Injury Hazard",
    "Date": "11/22/2023",
    "Summary": "This recall involves Balloon Time Mini Helium Tanks that are used to fill up to 20 balloons with helium. They measure about 13.5 inches tall by 3.5 inches in diameter. The helium tanks have a red label and purple cap and hold 5.8 cubic feet of helium/air mixture.",
    "Repair Number": 24030
  },
  {
    "Title": "Lenovo Recalls USB-C Laptop Power Banks Due to Fire Hazard",
    "Date": "11/22/2023",
    "Summary": "This recall involves the Lenovo USB USB-C Laptop Power Bank with model number PBLG2W. The power bank has a 20,000 mAh rechargeable lithium-ion battery used to charge laptops, cell phones, and other devices when an electrical outlet is not available. The power bank is black and measures approximately 7 inches long by 3 inches wide. \"Lenovo\" is printed in black letters on a red tag on the USB power cord. The recalled units were manufactured between January 2022 and June 2022. The manufacturing date is located on the product label in a year/month (YY/MM) format. The recalled units have the manufacturing date of 22/01, 22/02, 22/03, 22/04, 22/05 or 22/06. The part number 40ALLG2WWW and the model number PBLG2W are also located on the product label.",
    "Repair Number": 24031
  },
  {
    "Title": "PandaEar Recalls Stainless Steel Children's Cups Due to Violation of Federal Lead Content Ban; Sold Exclusively on Amazon.com (Recall Alert)",
    "Date": "11/22/2023",
    "Summary": "This recall involves the 8 oz. models of PandaEar Stainless Steel Toddler Cups sold in sets of two, in pink and gray or blue and gray colors with matching silicone straws. There are no exterior markings on the cups.",
    "Repair Number": 24716
  },
  {
    "Title": "MI Windows and Doors Recalls Vinyl Sliding Glass Doors Due to Serious Injury Hazard (Recall Alert)",
    "Date": "11/22/2023",
    "Summary": "This recall involves certain MI Windows and Doors 1615 and 1617 sliding glass doors (if sold as impact-resistant or with a DP50 upgrade), Window World 4000 Series sliding glass doors (with DP50 upgrade), and Window World 8000 Series sliding glass doors. The doors were sold in several colors and sizes with a variety of handle options. All recalled doors have an aluminum interlock and an LC-PG50 performance grade. The recalled impact doors have MTL-12 on the door label; recalled DP50 doors have MTL-12 or MTL-2. The door label located at the top of the window also has the manufacturer, series number, performance grade, and manufacture date (MFG: M/YYYY) on the label.",
    "Repair Number": 24717
  },
  {
    "Title": "ZLINE Expands Consumer Options in Recall of Gas Ranges; Serious Risk of Injury or Death from Carbon Monoxide Poisoning",
    "Date": "11/21/2023",
    "Summary": "This recall involves the oven compartment of ZLINE gas ranges with model numbers RG30, RGS-30, RGB-30, RG36, RGS-36, RGB-36, RG48, RGS-48 and RGB-48. The ranges were sold in various door colors including black matte, blue gloss, blue matte, DuraSnow, red gloss, red matte and white matte and multiple finishes including stainless steel, black stainless steel and DuraSnow, a cloudy steel finish. The recalled ranges were sold in three sizes, 30 inches, 36 inches and 48 inches. The ZLINE logo is printed on the bottom of the door. The model number is printed on a label on the back of the range. For ranges purchased after 2020, the model number is also printed on a label underneath the right side of the range top, visible when the oven door is open. Only ZLINE gas ranges with these model numbers are included in this recall.",
    "Repair Number": 24028
  },
  {
    "Title": "Tractor Supply Company Recalls Red Shed Hammock Swing Chairs Due to Fall Hazard",
    "Date": "11/16/2023",
    "Summary": "This recall involves Red Shed Hammock Swing Chairs. The chairs have a blue and silver mesh fabric seat with black nylon straps attached to arm rests on a black metal frame. The chairs were sold with a removable hang tag that includes a picture of the chair beneath the Red Shed® Home & Gifts logo.",
    "Repair Number": 24026
  },
  {
    "Title": "Khaite Recalls Women's High Heeled Sandals Due to Fall Hazard",
    "Date": "11/16/2023",
    "Summary": "This recall involves three styles of KHAITE high heeled sandals. The style names are LINDEN SANDAL, LOUISA STRAPPY SANDAL and SEIGEL HEEL SANDAL from the Spring Summer 2024 collection. The model numbers are F3047-780-580, F3057-803-121, F3057-726-200, F3053-809-200, F3053-809-100, F3053-726-826, F3047-808-362, F3047-803-121, F3047-790-905, F3047-783-170 are printed on the shoeboxes. \"Khaite\" is printed on the soles of all Khaite shoes. Style Code Description Color Fabric Price F3053-726-826 LOUISA STRAPPY SANDAL VIOLET SUEDE $1080 F3053-809-200 LOUISA STRAPPY SANDAL BLACK LEATHER $1080 F3053- 809-100 LOUISA STRAPPY SANDAL WHITE LEATHER $1080 F3057-726-200 SEIGEL HEEL SANDAL BLACK SUEDE $920 F3057-803-121 SEIGEL HEEL SANDAL NATURAL NOVELTY MATERIAL $920 F3047-780-580 LINDEN SANDAL SCARLET RED PATENT LEATHER $950 F3047-790-905 LINDEN SANDAL KHAKI LEATHER $1080 F3047-783-170 LINDEN SANDAL WARM WHITE LEATHER $920 F3047-803-121 LINDEN SANDAL NATURAL NOVELTY MATERIAL $980 F3047-808-362 LINDEN SANDAL SAPPHIRE NOVELTY MATERIAL $980",
    "Repair Number": 24027
  },
  {
    "Title": "Stainless Steel Children's Cups Recalled Due to Violation of Federal Lead Content Ban; Sold Exclusively at Amazon.com by LAOION (Recall Alert)",
    "Date": "11/16/2023",
    "Summary": "This recall involves the 8 oz models of LAOION children's cups. The insulated, stainless steel cups were sold in packs of four different colored cups - lilac, green, salmon, and blue - with matching silicone straws, spill-proof lids and one straw brush. \"LAOION\" is printed on the front bottom of the cups.",
    "Repair Number": 24714
  },
  {
    "Title": "Target Recalls Hearth & Hand™ with Magnolia Toy Mushroom Peg Sorters Due to Choking Hazard (Recall Alert)",
    "Date": "11/16/2023",
    "Summary": "This recall involves Hearth & Hand with Magnolia 13-Piece Toy Mushroom Peg Sorter with the model number 324-06-3185. The playset includes a board with mushrooms decorated in a dotted pattern in multiple colors. The board measures about 6 inches wide and 8 inches long. The model number is located on the underside of the board.",
    "Repair Number": 24715
  },
  {
    "Title": "Amer Sports Winter & Outdoor Recalls Ski Touring Bindings Due to Fall and Injury Hazards",
    "Date": "11/9/2023",
    "Summary": "This recall involves Armada, Atomic, and Salomon brand ski touring bindings. The ski bindings hold a consumer's ski boot in place on the ski. The brand name is printed on the heel of the ski binding. The recall includes the following brands and model names having the following serial numbers: serial numbers ranging from 22P00000 to 22P10531; 22P92954 to 22P99999, 23P10531 to 23P10886 and 230600000 to 230769999 are included in this recall. The serial number is only visible when the bindings are disassembled. Consumers should visit authorized dealers who will disassemble and verify if a binding is included in this recall. The only ski bindings included in this recall have gray springs in the toe component. Brand Model name Armada N TRACER SUMMIT 9 BR Black Armada N TRACER TOUR Black Atomic N BACKLAND PURE Black/Gunmetal Atomic N BACKLAND SUMMIT 12 BR Atomic N BACKLAND SUMMIT 12 LSH Atomic N BACKLAND SUMMIT 5 BR Atomic N BACKLAND SUMMIT 9 BR Atomic N BACKLAND SUMMIT 9 LSH Atomic N BACKLAND TOUR Black/Gunmetal Salomon N MTN PURE Black/Titan Salomon N MTN SUMMIT 12 BR Orange/Burnt Salomon N MTN SUMMIT 12 LSH Orange Salomon N MTN SUMMIT 5 BR Gold Salomon N MTN SUMMIT 9 BR Titan Salomon N MTN TOUR Black/Titan",
    "Repair Number": 24021
  },
  {
    "Title": "DR Power Equipment Recalls Tow-Behind Field & Brush Mowers Due to Fire and Burn Hazards",
    "Date": "11/9/2023",
    "Summary": "This recall involves DR Power Equipment and Generac brand tow-behind field and brush mowers. The following model and serial numbers, printed on a white label that is on the rear frame of the mower near the right rear tire, are included in this recall. Name Model Number Serial Number Range DR Power Tow-Behind Field and Brush Mower TB 25044B EN All serial numbers beginning with TB2, plus 3002188267 to 30024310751 TB 25044B ENC 30030052232 to 3004525033 TB 25044B ENR 3004734233, 3004835965, 3005064288, 3005471720, 3005548665, 3007678624, 3008122643 TBM 20A ED TDVE OF1 All serial numbers beginning with TB; in addition, 300275210 TBM 20A EN TDVE OD3 All TBM 20A EN TDVE OF3 TBM20AENTDVEOF3 All 3002188263 to 3002490281 Generac Tow-Behind Field and Brush Mower TB 25044GENG 3003540054 to 3004428691",
    "Repair Number": 24022
  },
  {
    "Title": "Twin-Star International Recalls Infrared Quartz Electric Fireplaces Due to Fire Hazard; Sold Exclusively at Lowe's",
    "Date": "11/9/2023",
    "Summary": "This recall involves Twin-Star Style Selections 42-inch-wide, 5,200 BTU, Black Infrared Quartz Electric Fireplace with model No. 42HF295FGT manufactured before January 2023 and identified with the following date codes: 0521; 0322; 0422; 0522; 0622; 0722; and 0822. \"Twin-Star International, Inc.\" and the model number are printed on the top panel of the fireplaces. The date code and serial number are printed on the back panel.",
    "Repair Number": 24023
  },
  {
    "Title": "IKEA Expands Recall of Mirrors Due to Laceration Hazard",
    "Date": "11/9/2023",
    "Summary": "This recall involves all sizes of LETTAN flat mirrors. The mirrors are frameless, about 38 inches high and were sold in 23, 31, 39 and 47 inches wide. LETTAN mirrors affected by this recall for repair now include: all LETTAN mirrors with a date stamp before and including 2105 (YYWW), and LETTAN mirrors with supplier number 21944 and a date stamp before and including 2325 (YYWW). The date stamp is in (YYWW) format where the first two digits represent the year, and the last two digits represent the week of manufacture. The date stamp is located on the back of the mirror.",
    "Repair Number": 24024
  },
  {
    "Title": "Textron Specialized Vehicles Recalls Arctic Cat and Tracker Side by Side Recreational Off Highway Vehicles Due to Crash Hazard (Recall Alert)",
    "Date": "11/9/2023",
    "Summary": "This recall involves all model year 2022 and 2023 Arctic Cat Prowler Pro and Pro Crew and all model year 2022 and 2023 Tracker Off Road 800SX and 800SX Crew Side by Side Recreational Off Highway Vehicles. The two-seat and four-seat vehicles were sold in various colors. The Arctic Cats have a \"Prowler Pro\" decal on the front hood and the Tracker Off Road vehicles have an \"800SX\" decal just outside the driver and passenger doors.",
    "Repair Number": 24709
  },
  {
    "Title": "Magnolia Market Recalls 3-Wick Glass Candles Due to Fire and Laceration Hazards (Recall Alert)",
    "Date": "11/9/2023",
    "Summary": "This recall involves Magnolia 26 oz. 3-Wick Glass Candles with batch number 120122. The recalled candles are in a frosted white glass container. LINEN, GREENHOUSE or STAY A WHILE are printed on the outside of the glass container. Only batch number 120122 is being recalled. The batch number is located on the label on the bottom of the candle, below the price.",
    "Repair Number": 24710
  },
  {
    "Title": "Polaris Recalls RANGER Off-Road Vehicles Due to Fire and Crash Hazards (Recall Alert)",
    "Date": "11/9/2023",
    "Summary": "This recall involves certain VINs of Model Year 2023 RANGER XP 1000 NorthStar and XP 1000 NorthStar Crew vehicles. The RANGER vehicles were sold in the following colors: blue, brown, camouflage, graphite and white. They were sold in three and six-seat configurations and have \"POLARIS\" stamped on the front grille. The model number and VIN are printed on a portion of the left rear frame (on the driver's side of the vehicle) under the cargo box.",
    "Repair Number": 24711
  },
  {
    "Title": "Children's Nightgowns Recalled Due to Burn Hazard and Violation of Federal Flammability Standards; Sold by iMOONZZZ Exclusively on Amazon.com",
    "Date": "11/9/2023",
    "Summary": "This recall involves four styles of iMOONZZZ-branded children's nightgowns. The nightgowns were sold in sizes 3-4T, 5-6 Years, 6-7 Years, 7-8 Years, 8-9 Years, and 10-12 Years. \"iMOONZZZ,\" \"Made in China,\" the size, the fiber content and the washing instructions are printed on a sewn-in, side-seam label. Style Style Color Fabric content Nightgowns for Girls, Long Vintage Soft Cotton Sleepwear, Full Length Nightdress White, pink, blue, Vintage floral, Sakura, Rainbow Castle, Colorful Floral, Sweet Rose, Striped Flowers 100% Cotton Nightgowns for Girls, Long Vintage Soft Cotton Sleepwear, Full Length Short Sleeve Nightdress White, pink, blue, Vintage Floral, Sakura 100% Cotton Nightgowns for Girls, Soft Cotton Long Sleeve Sleepwear, Full Length Mesh Nightdress White Shell: 100% Polyester, Lining: 95% Cotton, 5% Spandex Girls Princess Nightgown, Winter Soft Fleece Long Sleeve Sleepwear Blue, white, pink 95% Polyester, 5% Elastane",
    "Repair Number": 24712
  },
  {
    "Title": "Textron Specialized Vehicles Recalls E-Z-GO PTV And Tracker OX EV Vehicles Due to Crash Hazard (Recall Alert)",
    "Date": "11/9/2023",
    "Summary": "This recall involves E-Z-GO PTV and Tracker OX EV vehicles. These vehicles are also called golf carts. Vehicles with Electric ELiTE Express S6 and L6 models with serial numbers 3591558, 3591568, 3591767-3591769 and 3597204 and 3608440 are included in the recall. Tracker OX EV with serial numbers between 8029703 and 8030650 are also included in the recall. The serial number is located under the charger receptacle on the E-Z-Go and Tracker vehicles. The model name is located on the side of the vehicles.",
    "Repair Number": 24713
  },
  {
    "Title": "Grizzly Industrial Recalls Wood Lathes Due to Injury and Laceration Hazards",
    "Date": "11/2/2023",
    "Summary": "This recall involves all G0584 and G0462 Grizzly Industrial, and the W1758 Shop Fox wood lathes. The variable-speed, electric wood lathes have a green or white bed and cast-iron legs with black accents, an extendable tool rest and a swivel headstock. Model G0584 measures 62 inches wide, 14.5 inches deep and 45.5 inches high. Models G0462 and W1758 measure 72.5 inches wide, 19 inches deep and 48 inches high. The Grizzly industrial wood lathes have the logo located on the front of the headstock and the model number on the side nameplate. The Shop Fox wood lathes have the logo located on the front of the bed, and the model on the front of the headstock and the side nameplate.",
    "Repair Number": 24016
  },
  {
    "Title": "Yoocaa Baby Loungers Recalled Due to Suffocation Risk and Fall and Entrapment Hazards; Fails to Meet Safety Requirements for Infant Sleep Products; Exclusively on Amazon.com by Yoocaa Direct",
    "Date": "11/2/2023",
    "Summary": "This recall involves baby loungers made of a cloth cover with a foam sleeping pad and padded bumper. The baby loungers were advertised as \"baby lounger\" and \"baby nest\" and were sold in different printed fabrics and colors, including animal, blue star, cloud, feather, flower, forest, leaf, pink star, polar bear and zoo. \"SLEEPING SET\" is printed on a tag sewn on the interior of the cover. The recall applies to products purchased on or after June 23, 2022, and consumers should review their Amazon purchase history to determine their purchase date. Consumers who still have the packaging can also review the packaging for a label that states the date of manufacture, marked in the format \"LOT: YYYYMMDD.\" This recall applies to products manufactured with \"LOT\" markings on the packaging of 20220623 (representing June 23, 2022) or later dates.",
    "Repair Number": 24017
  },
  {
    "Title": "Lochinvar Recalls Condensing Boilers Due to Risk of Carbon Monoxide Poisoning",
    "Date": "11/2/2023",
    "Summary": "This recall includes residential condensing boilers, combi boilers and packaged systems sold by Lochinvar from August 2021 through August 2023. They were sold under the Lochinvar, A. O. Smith, and State Industries brand names and have serial numbers within the range of 125325485 through 134830284. The brand name is printed on the front of each unit. The model number and serial number can be found on the data plate on the product located on the unit's rating plate, which is located either on the inside or outside of the outer jacket of the unit. The following brands and model numbers are included in the recall. Lochinvar Brand NCF110L NCF110N NCF150L NCF150N NCF199L NCF199N NKB080L NKB080N NKB110L NKB110N NKB150L NKB150N NKB199L NKB199N NKC110L NKC110N NKC150L NKC150N NKC199L NKC199N A. O. Smith Brand ACB 110H-N ACB 110H-P ACB 110S-N ACB 110S-P ACB 150H-N ACB 150H-P ACB 150S-N ACB 150S-P ACB 199H-N ACB 199H-P ACB 199S-N ACB 199S-P State Industries Brand SCB 110H-N SCB 110H-P SCB 110S-N SCB 110S-P SCB 150H-N SCB 150H-P SCB 150S-N SCB 150S-P SCB 199H-N SCB 199H-P SCB 199S-N SCB 199S-P",
    "Repair Number": 24018
  },
  {
    "Title": "Dixon Ticonderoga Recalls Creativity Street Children's Assorted Craft Buttons Due to Violation of Federal Lead Content Ban",
    "Date": "11/2/2023",
    "Summary": "This recall involves Creativity Street Assorted Craft Buttons. The buttons were sold in a one-pound clear plastic bag. There is a cardboard label on the bag that is yellow, orange and blue with the words \"Creativity Street\" and \"Assorted Craft Buttons\". \"PAC6121\", \"MADE IN CHINA\" and lot code \"02129171221\" are printed on the back.",
    "Repair Number": 24019
  },
  {
    "Title": "UncleWu Life Recalls Infant Bath Seats Due to Drowning Hazard; Violation of Bath Seat Requirements; Sold Exclusively on Amazon.com (Recall Alert)",
    "Date": "11/2/2023",
    "Summary": "The recall includes UncleWu Life infant bath seats. The bath seats are made of molded plastic and were sold in navy and powder blue color combinations with suction cups on the bottom of the seats. The bath seat has a seat back, flat base and a T-shaped handle. A label on the bottom of the bath seat contains: \"X002WZ4SCX…UNCLE WU Baby Bath Seat…w air for 6-18 Mos.\" A label printed on the back of the bath seat lists the model name, date, location of manufacturer and model number YD108. Another label on the back of the seat states the product is not a safety device. A label on the disposable packaging of the bath seat contains: \"X002WZ4SCX…UNCLE WU Baby Bath Seat.",
    "Repair Number": 24707
  },
  {
    "Title": "Murf Electric Bikes Recalls Electric Bicycles Due to Fall and Injury Hazards (Recall Alert)",
    "Date": "11/2/2023",
    "Summary": "This recall involves all Murf's electric bicycles (e-bikes) sold prior to April 20, 2022. The electric bikes have an electric assist motor and are equipped with a bell, a headlight and a tail light. \"Murf\" is printed on the sides of the down tube of the bicycle frame. The electric bikes were sold in black, white, beige, blue, cream, gray or green colors. Model Name Model Years The Fat Murf 2017-2022 Alpha Cargo 2017-2022 Alpha Murf 2017-2022 Fat Murf Step Thru 2017-2022 Fat Pax Step Thru 2017-2022 Izzy Step Thru 2017-2022 Mini Murf 2017-2022 Pax Step Thru 2017-2022 Izzy Beach Cruiser 2017-2022",
    "Repair Number": 24708
  },
  {
    "Title": "Best Buy Recalls Insignia™ Pressure Cookers Due to Burn Hazard",
    "Date": "10/26/2023",
    "Summary": "This recall involves Insignia Multi-Function Pressure Cookers with model numbers NS-MC60SS8, NS-MC60SS9, or NS-MC80SS9, and inner cooker pots with model numbers NS-MCRP6NS9 and NS-MCRP6SS9, sold separately as replacements. The electric pressure cookers and inner cooker pots are six- and eight-quart capacity. The brand name INSIGNIA appears on the front of each unit and on its permanent on-product label. The model number of the recalled pressure cookers is also printed on the permanent on-product label on the side of the cooker. The inner cooker pots are black with a non-stick coating and embossed markings indicating cup and liter measurements. Consumers should always check that the inner pot is not filled beyond two-thirds capacity when pressure cooking, that the lid is fully locked before pressure cooking is started, and that the floating locking valve has dropped before attempting to open the lid when pressure cooking.",
    "Repair Number": 24013
  },
  {
    "Title": "Dorel Juvenile Group Recalls Cosco Jump, Spin & Play Activity Centers Due to Fall and Injury Hazards; Sold Exclusively at Walmart",
    "Date": "10/26/2023",
    "Summary": "This recall involves Cosco Jump, Spin & Play Activity Centers with model numbers WA105FZW and WA105GML. The activity centers have a circular hoop base and three poles from which a child seat with a play tray is suspended by three straps. The activity centers are sold in blue and pink, and feature two removable toy animals on the play tray at the front of the seat as well as two toy animals hanging from the front two poles. The activity centers can be adjusted to three different heights.",
    "Repair Number": 24014
  },
  {
    "Title": "Kawasaki Motors USA Recalls Engines Used in Lawn and Garden Equipment Due to Fire and Burn Hazards (Recall Alert)",
    "Date": "10/26/2023",
    "Summary": "This recall involves Kawasaki engines used in riding lawn mowers sold under the Ariens brand name with mower models IKON, IKON Onyx, and Apex, and under the Gravely brand name with mower models ZT X, ZT XL, ZT HD, and ZT HD Stealth, and under the Husqvarna brand name with mower models TS142TXD, TS242TXD, TS242XD, Z248F, and Z254F, and under the John Deere brand name with mower models Z330M and Z330R, and under the RedMax brand name with mower model RZT48. The recalled engines are model year 2023 FR730V, FR691V, and FR651V. The recalled engine model and serial numbers are located on the engine fan housing. The following model and serial number ranges are included in this recall. Engine Model Number Specification Number FR651V GS28 FR691V GS19 ES29 FR730V FS15 Engine Serial Number Range A full list of serial numbers included in this recall are on the firm's website at www.kawasakienginesusa.com/product-recall.html recall notice RP230415.",
    "Repair Number": 24705
  },
  {
    "Title": "Doosan Bobcat North America Recalls Bobcat and Kubota Stand-On Zero Turn Lawnmowers Due to Crash and Laceration Hazard (Recall Alert)",
    "Date": "10/26/2023",
    "Summary": "This recall involves Bobcat-branded and Kubota-branded stand-on zero-turn lawnmowers. The Bobcat stand-on zero-turn lawnmowers are black and white with the Bobcat name and logo on an orange background. They also have orange wheel wells. The Kubota stand-on zero-turn lawnmowers are orange and black with the Kubota name in white and orange wheel wells. The following model and serial numbers, located on the right side of the frame just above the operator platform, are included in this recall. The recalled engines are model year 2023 FR730V, FR691V, and FR651V. The recalled engine model and serial numbers are located on the engine fan housing. The following model and serial number ranges are included in this recall. Bobcat: MODEL SERIAL NUMBER ZS4036 999400100961 thru 999400100973 999400100975 thru 999400101046 999400101049 thru 999400101053 999400101055 ZS4036 SJAU 9994001AU80157 thru 9994001AU80165 9994001AU80168 thru 9994001AU80169 ZS4048 999400201096 thru 999400201170 ZS4048 SFAU 9994002AU00141 thru 9994002AU00145 ZS4052 999400301247 thru 999400301380 999400301382 thru 999400301385 999400301387 thru 999400301397 ZS4052 SKAU 9994003AU00125 ZS4061 999400400750 thru 999400400822 999400400826 thru 999400400831 999400400833 thru 999400400834 999400400836 thru 999400400838 ZS4061 SKAU 9994004AU00111 thru 9994004AU00112 Kubota: MODEL SERIAL NUMBER SZ19NC-36-2 14490 thru 14517 14618 thru 14620 14678 thru 14679 14803 thru 14818 14835 thru 14850 14856 thru 14857 14922 thru 14927 15051 thru 15062 SZ22NC-48-2 14380 14401 thru 14412 14566 thru 14568 14666 thru 14677 14695 thru 14700 14706 thru 14711 14790 thru 14796 14858 thru 14869 14928 thru 14931 15030 thru 15044 SZ26NC-52-2 14429 thru 14446 14466 thru 14471 14474 14484 thru 14489 14577 thru 14609 14692 thru 14694 14701 thru 14705 14712 thru 14717 14780 thru 14783 14872 thru 14888 14892 14921 14944 thru 14967 14992 thru 15007 SZ26NC-61-2 14417 thru 14425 14475 thru 14483 14622 thru 14643 14718 14763 thru 14771 14893 thru 14904 14971 thru 14991 15014 thru 15026 SZ19-36-2CAD 14558 thru 14565, 14801 SZ22-48-2CAD 14569 thru 14576, 14870 thru 14871, 15045 SZ26-61-2CAD 15009 thru 15013, 15029 1698562",
    "Repair Number": 24706
  },
  {
    "Title": "Fortress Safe Announces Recall of Biometric Gun Safes Due to Serious Injury Hazard and Risk of Death; One Death Reported",
    "Date": "10/19/2023",
    "Summary": "The recalled gun safes are portable lock boxes, personal safes, pistol vaults, and gun cabinets with brand names Fortress, Cabela's, Gettysburg, and Legend Range & Field. Model numbers can be found above the barcode on a label located on the back of the safe and on the top right corner of the original packaging. Safes with the following model numbers are included in this recall. Model # Description 11B20 Fortress Portable Safe with Biometric Lock 44B10 Fortress Personal Safe with Pop up door and Biometric Lock 44B10L Legend Range & Field Personal Safe with Pop up door and Biometric Lock 44B20 Fortress Medium Personal Safe with Biometric Lock 55B20 Fortress Quick Access Safe with Biometric Lock 55B30 Fortress Large Quick Access Safe with Biometric Lock 55B30G Gettysburg Large Quick Access Safe with Biometric Lock 4BGGBP Cabela's 4 Gun Safe with Biometric Lock 55B30BP Cabela's Biometric Personal Safe",
    "Repair Number": 24011
  },
  {
    "Title": "Thomas & Friends Wooden Railway Troublesome Truck & Crates and Troublesome Truck & Paint Recalled by Fisher-Price Due to Choking and Magnet Ingestion Hazards",
    "Date": "10/19/2023",
    "Summary": "This recall involves Thomas & Friends Wooden Railway Troublesome Truck & Crates and Troublesome Truck & Paint. The push along wooden trains are designed to look like the characters from Thomas & Friends called the Troublesome Trucks. The Troublesome Truck & Crates is a black and gray train car with cargo of brown crates. The Troublesome Truck & Paint is a gray and black train car with cargo of gray paint cans and a yellow paint splatter on the side. Both train cars have faces on the front of them. The trains come with magnetic connectors to attach to other vehicles. The train cars measure approximately 3.6 inches long by 2.1 inches high. Model numbers HBJ89 (Troublesome Truck & Crates) and HBJ90 (Troublesome Truck & Paint) can be found on the bottom of the train cars.",
    "Repair Number": 24010
  },
  {
    "Title": "Polaris Recalls RZR PRO XP, PRO XP 4, RZR XP and XP 4 Recreational Off-Road Vehicles (ROVs) Due to Crash Hazard (Recall Alert)",
    "Date": "10/19/2023",
    "Summary": "This recall involves certain VINs of Model Year 2023 RZR PRO XP and PRO XP 4 and Model Year 2024 RZR XP and XP 4 vehicles. The recalled vehicles were sold in the following colors: black, graphite, gray, red and white. The recalled vehicles were sold in two- and four-seat configurations. POLARIS is stamped on the front grille and POLARIS and RZR are printed on the sides of the vehicles. The model name is also printed on the side of the chassis. The VIN is located on the vehicle's frame in the left rear wheel well.",
    "Repair Number": 24704
  },
  {
    "Title": "The FORT Recalls Children's Play Tents Due to Choking and Laceration Hazards",
    "Date": "10/12/2023",
    "Summary": "This recall involves The FORT children's play tent. The children's play tent consists of 12 cushions made of polyurethane foam in various shapes (squares, rectangles, half-moons, triangles and arches) that are covered with a durable synthetic leather fabric. The play tent was sold in 12 different colors. The play tent measures about 30 inches high and 26 inches wide when constructed.",
    "Repair Number": 24006
  },
  {
    "Title": "Little Sleepies Recalls Sleepyhead Loveys and Bandana Bibs Due to Choking Hazard",
    "Date": "10/12/2023",
    "Summary": "This recall involves the Little Sleepies Sleepyhead Lovey and Bandana Bib. The recalled Sleepyhead Loveys are intended to be used by babies and toddlers as a security blanket. The recalled Bandana Bibs are intended to be worn by babies during mealtime to protect clothing, as well as for drooling or teething babies and toddlers. The products come in a variety of colors and patterns.",
    "Repair Number": 24007
  },
  {
    "Title": "Countertop Nugget Ice Makers Recalled Due to Laceration Hazard ; Sold Exclusively through Amazon; Distributed by Far Success Trading",
    "Date": "10/12/2023",
    "Summary": "This recall involves Gevi Household Countertop Nugget Ice Makers with model number GIMN-1102 and a date code of before June 1, 2022. The model number and date code are listed on the product label on the back of the unit. The ice makers are stainless steel and with a white, black or blue exterior top and come with an ice basket, ?ice scooper and a 1/4'' water inlet hose. They measure about 10 inches wide and 17 inches high.",
    "Repair Number": 24008
  },
  {
    "Title": "YourHealthToolkit Recalls Children's Weighted Blankets Due to Asphyxiation Hazard; Sold Exclusively on Amazon.com (Recall Alert)",
    "Date": "10/12/2023",
    "Summary": "This recall involves 36-inch by 48-inch children's 5-pound weighted blankets sold exclusively on Amazon.com. The blankets have a zipper pouch. The blankets were sold in aqua blue on one side and gray on the other with fabric quilting and raised fabric dots, and have a YourHealthToolkit (YHT) logo attached as a hangtag to the seams of the blanket.",
    "Repair Number": 24702
  },
  {
    "Title": "Family Health Products Recalls Crystal Clear Sodium Hydroxide Products Due to Failure to Meet Child-Resistant Packaging Requirement; Sold Exclusively on Amazon.com (Recall Alert)",
    "Date": "10/12/2023",
    "Summary": "This recall involves Family Health Products Crystal Clear Sodium Hydroxide products. Sodium hydroxide is commonly used for soapmaking and cleaning. The sodium hydroxide, also called lye or caustic soda, was sold in a resealable two-pound bag with \"CRYSTAL CLEAR\", \"SODIUM HYDROXIDE\", \"Protect, Deliver, Clean\", and \"NaOH\" printed in large type.",
    "Repair Number": 24703
  },
  {
    "Title": "Cocco Candy and KGR Distribution Recall Cocco's Candy Rolling Candy Due to Choking Hazard; One Death Reported",
    "Date": "10/5/2023",
    "Summary": "This recall involves Cocco Candy's Rolling Candy consisting of 2 fluid ounces in various flavors including Sour Strawberry, Sour Tutti Frutti, and Sour Cola. Cocco Candy Rolling Candy with the following barcode printed on the back of the product are included in the recall: Product Name Unit Barcode Display Barcode Carton Barcode Cocco Candy Strawberry Flavored Rolling Candy 8683363414008 8683363414367 8683363414176 Cocco Candy T. Frutti Flavored Rolling Candy 8683363414015 8683363414367 8683363414176 Cocco Candy Cola Flavored Rolling Candy 8683363414022 8683363414367 8683363414176",
    "Repair Number": 24002
  },
  {
    "Title": "Candy Dynamics Recalls 70 Million Slime Licker Sour Rolling Liquid Candies Due to Choking Hazard",
    "Date": "10/5/2023",
    "Summary": "This recall involves Slime Licker Sour Rolling Liquid Candy, sold in two-ounce and three-ounce containers. The product consists of a plastic bottle with a rolling ball that holds a sour liquid candy. The product was sold in blue (Blue Razz), red (Strawberry), green (Sour Apple) and pink (Black Cherry) packaging with \"TOXIC WASTE\" brand and \"SLIME LICKER Sour Rolling Liquid Candy\" or \"MEGA TOXIC WASTE\" brand and \"SLIME LICKER Sour Rolling Liquid Candy\" printed on the front label. Products with the following UPC Codes are included in this recall: Product Name Size UPC Code Slime Licker® Sour Rolling Liquid Candy (Blue Razz & Strawberry) 2 oz. 8-98940-00101-6 Slime Licker® Sour Rolling Liquid Candy (Blue Razz & Strawberry) 2 oz., 2 pack 8-98940-00191-7 Mega Slime Licker® Sour Rolling Liquid Candy (Blue Razz & Strawberry) 3 oz. 8-98940-00169-6 Slime Licker® Sour Rolling Liquid Candy (Black Cherry & Sour Apple) 2 oz. 8-50034-59720-1 Slime Licker® Sour Rolling Liquid Candy (Blue Razz & Strawberry) 2 oz. 0-60631-91829-7",
    "Repair Number": 24001
  },
  {
    "Title": "Russound Recalls MCA-88 Multizone Controller Amplifiers Due to Fire Hazard",
    "Date": "10/5/2023",
    "Summary": "This recall involves the Russound MCA-88 Multizone Controller Amplifier that provides up to eight zones of distributed audio. The controller measures about 17 inches wide by 3.5 inches high by 17.2 inches deep and weighs 28.8 pounds. The unit has model number MCA-88 on the front of the housing. The units that are subject to recall have serial numbers that begin with four digits ranging from 2047 through 2307. The serial numbers are located on a visible label on the front of the unit under the clear plastic cover. \"Russound\" is printed on the front of the amplifier.",
    "Repair Number": 24003
  },
  {
    "Title": "Children's Blanket Sleepers and Robes Recalled by International Intimates Due to Burn Hazard and Violation of Federal Flammability Standards",
    "Date": "10/5/2023",
    "Summary": "This recall involves Rene Rofe Girl Children's Blanket sleepers and hooded robes. The 100% polyester blanket sleepers and robes were sold in sizes for ages 6 - 14 years. The size, \"Rene Rofe Girl,\" Style # 426989 or 436989, PO #JZJ0005, washing instructions and Date 6/1 are printed on the neck label. One of the following GPU #'s are also listed ACG2103, ACG2101, ACG2106, ACG2107, ACG2104, ACG2109, ACG2105, ACG2102, ACG2108, ACG2112, ACG2110, ACG2115, ACG2116, ACG2113, ACG2118, ACG2114, ACG2111, ACG2117.",
    "Repair Number": 24004
  },
  {
    "Title": "CURiO Recalls Capri Blue Pet Products Due to Risk of Exposure to Bacteria (Recall Alert)",
    "Date": "10/5/2023",
    "Summary": "This recall involves all Capri Blue Deodorizing Pet Bedding Spray, Capri Blue Waterless Foaming Shampoo, Capri Blue Deodorizing Fragrance Spritz and Capri Blue Detangling and Conditioning Spray. The spray bottles are blue and white. \"capri BLUE\" and the product name are printed on the label.",
    "Repair Number": 24701
  },
  {
    "Title": "Future Motion Recalls Onewheel Self-Balancing Electric Skateboards Due to Crash Hazard; Four Deaths Reported",
    "Date": "9/29/2023",
    "Summary": "This recall involves all models of Future Motion Onewheel self-balancing electric skateboards, including Onewheel (original), Onewheel+, Onewheel+ XR, Onewheel Pint, Onewheel Pint X and Onewheel GT. The model name is on the side of the skateboard. The Onewheel logo is printed on the rail of the skateboards.",
    "Repair Number": 23299
  },
  {
    "Title": "Trek Recalls Allant+ 7 Bicycles Due to Crash Hazard",
    "Date": "9/28/2023",
    "Summary": "This recall involves Trek Allant+ 7 bicycles. Trek is printed on the bicycle's frame and the model name is printed on the top tube. The following models are included in this recall: Allant+ 7 (Nautical Navy) Allant+ 7 Lowstep (Nautical Navy) Allant + 7S (Nautical Navy and Matte Quicksilver) Allant +7S Stagger (Nautical Navy and Matte Quicksilver)",
    "Repair Number": 23295
  },
  {
    "Title": "Procter & Gamble Recalls Zevo Fly, Gnat and Fruit Fly Insect Spray Due to Injury and Laceration Hazards",
    "Date": "9/28/2023",
    "Summary": "This recall involves Zevo Fly, Gnat and Fruit Fly Flying Insect Killer3 Value Packs. The twin pack aerosol containers are shrink-wrapped together with a white and purple label. The batch code 3045D185EW3 is printed on the bottom of the aerosol containers or on the shrink-wrap. \"Zevo Insect Killer\" and \"Fly, Gnat & Fruit Fly\" and \"Kills on Contact\" are printed on the shrink-wrap.",
    "Repair Number": 23296
  },
  {
    "Title": "Nutraceutical Recalls Solaray Liposomal Multivitamins Due to Failure to Meet Child Resistant Packaging Requirement; Risk of Poisoning",
    "Date": "9/28/2023",
    "Summary": "This recall involves Solaray Liposomal Women's in 60 and 120 count, Solaray Universal Multivitamin in 60 and 120 count, and Solaray Liposomal Women's 50+ Multivitamin in 120 count. The bottles are a clear silver color with white pop top lids. The white label on the front of the bottles displays the Solaray logo, product name, product type and size count. The 60 count bottles are contained in cartons, which are substantially similar in appearance to the bottles inside. All lots are included in the recall. Name Count SKU Solaray Liposomal Women's 60 076280193251 Solaray Liposomal Women's 120 076280339536 Solaray Universal Multivitamin 60 076280640168 Solaray Universal Multivitamin 120 076280830385 Solaray Liposomal Women's 50+ Multivitamin 120 076280154832",
    "Repair Number": 23297
  },
  {
    "Title": "Rust-Oleum Recalls Fluorescent Pink Spray Paint Due to Injury Hazard",
    "Date": "9/28/2023",
    "Summary": "This recall involves Rust-Oleum Professional Fluorescent Pink Marking Paint in a 15 oz. metal can. The cans have a fluorescent pink plastic lid that matches the color of the paint. Products sold at Lowe's state \"WATER BASED FORMULA\" on the can. The lot code for the recalled products is S34052 for units sold at Lowe's and S34054 for units sold through other retailers. The lot code is printed on the bottom of the can. Only these lot codes are included in the recall.",
    "Repair Number": 23298
  },
  {
    "Title": "Secura Recalls Air Fryers Due to Fire and Burn Hazards (Recall Alert)",
    "Date": "9/28/2023",
    "Summary": "This recall involves Secura air fryers with model number SAF-53D (TXG-DT16E) with date code 1901, and model number SAF-53 (TXG-DS16) with date codes 1903 and 1904. They are a black color with silver accent. The brand name Secura is on the top of each unit. The model number and four-digit date code are printed on the silver labels located at the bottom of each unit. The air fryers measure about 12 inches high, 11 inches deep and 12 inches wide.",
    "Repair Number": 23794
  },
  {
    "Title": "Polaris Recalls Ranger Recreational Off-Highway Vehicles and Pro XD Utility Vehicles, Gravely ATLAS Utility Vehicles, and Bobcat Utility Vehicles Due to Injury Hazard (Recall Alert)",
    "Date": "9/28/2023",
    "Summary": "This recall involves certain VINs of Model Year 2023 Polaris RANGER XP 1000 / XP 1000 Crew, RANGER 1000 / 1000 Crew and Model Year 2024 Polaris Pro XD Full-Size Diesel Crew, Model Year 2024 Gravely ATLAS JSV-3400 and Model Year 2024 Bobcat UV34XL Gas off road vehicles. The RANGER vehicles were sold in the following colors: blue, graphite, camouflage, brown and white. The Pro XD vehicles have gray plastic body panels with a black frame/accents. The RANGER vehicles were sold in three- and six-seat configurations. The Pro XD, Gravely and Bobcat vehicles have two or four seats. The RANGER and Pro XD vehicles have \"POLARIS\" stamped on the front grille, the Gravely vehicles have \"Gravely\" stamped on the front grille and the Bobcat vehicles have the Bobcat logo on the front grille.",
    "Repair Number": 23796
  },
  {
    "Title": "HONEY JOY Recalls Infant Swings Due to Suffocation Hazard and Violation of Federal Safety Standards; Sold Exclusively on Amazon.com",
    "Date": "9/21/2023",
    "Summary": "The recall involves HONEY JOY COMPANY infant swings, models BB5569US-GR in gray and BB5569US-BE in beige, made of metal and plastic with a cloth seat. The swings measure about 28 inches wide by 28 inches high and 24 inches wide. \"Babyjoy\" is displayed on the front of the swings and on the seat label. The infant swings include a head pillow, five-point restraint system, canopy with hanging toys, a music function and an adjustable seat. The swings can be powered using AAA batteries or an AC adaptor and include a remote control with Bluetooth functionality. The full model number can be found on the packaging, the instructional literature identifies model BB5569 and the product registration card, which consumers may have saved for their records identifies model BB5569US.",
    "Repair Number": 23290
  },
  {
    "Title": "DR Power Equipment Recalls DR Power Chipper Shredders Due to Laceration Hazard",
    "Date": "9/21/2023",
    "Summary": "This recall involves DR Power Equipment Chipper Shredders with model numbers CS35050BEN, CS35050BENR, CS35050BENSD, CS35150BEN, CS35150BENR, CS35150BENSD, CS35150DEN, CS45040DMN, CS45040DEN, CS45040DENR, CS45040DMNR, CS43030DMN and CS43030DMNR. For model numbers beginning CS3, the model number is on the side of the unit. For model numbers beginning CS4, the model and serial numbers are printed on a white label located on the base of the machine to the left of the engine manual start handle. The chippers were sold in orange and black with a funnel at the top to shred brush.",
    "Repair Number": 23291
  },
  {
    "Title": "Make Believe Ideas Recalls Seven Rainbow Road Board Books Due to Choking Hazard",
    "Date": "9/21/2023",
    "Summary": "This recall involves seven board books under the Rainbow Road Series Board Books. The books are children's board books bound together with plastic rings. The books were sold individually as well as in a book box with four books. The recall includes the following board books and ISBN numbers. The ISBN number is printed on the book's right hand corner on the back above the bar code. Book Title ISBN Animal Counting 9781803374802 Dinosaur's First Words 9781803374932 and 9781803372211 Old MacDonald Had a Farm 9781803376790 and 9781803373355 Rainbow Road Book Box 9781803376288 There Was an Old Lady Who Swallowed a Fly 9781803372945 and 9781803371580 Things that Go! 9781803374826 Unicorn's Colors 9781803374789 and 9781803376622 Where's My Bottom? 9781803372723 and 9781803376738",
    "Repair Number": 23292
  },
  {
    "Title": "H&M Recalls Men's Clasp Beaded Bracelets Due to Lead Poisoning Hazard; High Levels of Lead Content",
    "Date": "9/21/2023",
    "Summary": "This recall involves men's clasp beaded bracelets. The double strand bracelet is made with glass and wooden beads and has a trigger clasp. The bracelet has brown, green and orange beads.",
    "Repair Number": 23293
  },
  {
    "Title": "Shimano Recalls Cranksets for Bicycles Due to Crash Hazard",
    "Date": "9/21/2023",
    "Summary": "This recall involves Shimano Ultegra FC-6800, Dura-Ace FC-9000, Ultegra FC-R8000, Dura-Ace FC-R9100 and FC-R9100P 11-Speed Bonded Hollowtech Road Cranksets manufactured prior to July 2019 sold individually and on bicycles sold by other manufacturers such as Trek and Specialized. A crankset is the component of the bicycle that the chain and pedals attach to for pedaling. The recalled models have printed 'Ultegra' or Dura Ace' logos on the arm. The affected models are pre-July 2019 production and have the following two letter production code on backside of the crank arm where the pedals are attached: KF, KG, KH, KI, KJ, KK, KL, LA, LB, LC, LD, LE, LF, LG, LH, LI, LJ, LK, LL, MA, MB, MC, MD, ME, MF, MG, MH, MI, MJ, MK, ML, NA, NB, NC, ND, NE, NF, NG, NH, NI, NJ, NK, NL, OA, OB, OC, OD, OE, OF, OG, OH, OI, OJ, OK, OL, PA, PB, PC, PD, PE, PF, PG, PH, PI, PJ, PK, PL, QA, QB, QC, QD, QE, QF, QG, QH, QI, QJ, QK, QL, RA, RB, RC, RD, RE, and RF.",
    "Repair Number": 23294
  },
  {
    "Title": "FXI Recalls Novaform ComfortGrande and DreamAway Mattresses Due to Risk of Mold Exposure; Sold Exclusively at Costco (Recall Alert)",
    "Date": "9/21/2023",
    "Summary": "This recall involves Novaform ComfortGrande 14-inch and Novaform DreamAway 8-inch mattresses. The ComfortGrande 14-inch mattress has a blue base with \"Novaform\" printed in white letters. The DreamAway 8-inch mattress has a gray base with \"Novaform\" printed in white letters. The item number is printed on the mattress box and on the law tag attached to the mattress. Only mattresses with the following model/item numbers and manufactured at FXI's San Bernardino, California facility between January 2, 2023 and April 28, 2023 are included in the recall (this information can be found on the law tag attached to the mattress): ComfortGrande 14\" Mattress ITM/ART # Price King 1413200 700 Cal King 1413201 700 Queen 1413202 580 Full 1413203 500 Twin 1413204 400 King 1413200 750 Queen 1413202 600 DreamAway 8\" Mattress ITM/ART # Price Twin 1698562 160 Full 1698564 210 Twin 1698562 150 Full 1698564 200",
    "Repair Number": 23793
  },
  {
    "Title": "TJX Recalls Foldable Bistro Set Chairs Due to Fall Hazard; Sold at Marshalls, T.J. Maxx, HomeGoods and Homesense Stores",
    "Date": "9/14/2023",
    "Summary": "This recall involves wooden folding chairs sold as part of three-piece foldable bistro sets under the Panama Jack and House & Garden brands. The sets consist of one small wooden table and two foldable chairs made with wood frames and black, anthracite, navy blue, beige, olive green, or off-white roping on the seat and back. They have either a Panama Jack or House & Garden hangtag that includes the chair and table dimensions and \"Made in Vietnam.\" Chair dimensions are 16.53\" x 20.47 x 32.28\" and the folding table dimensions are 23.62 x 23.62 x 28.74.",
    "Repair Number": 23280
  },
  {
    "Title": "STIHL Recalls MSA 300 Chain Saws Due to Laceration Hazard",
    "Date": "9/14/2023",
    "Summary": "This recall involves the braking system of the STIHL MSA 300, a battery-powered chain saw. The chain saw is gray and orange. \"STIHL\" and \"MSA 300\" are displayed on the side of the chain saw. The recalled chain saw's serial number is located on a label on the rear hand guard. Serial numbers lower than 447457319 are included in the recall.",
    "Repair Number": 23282
  },
  {
    "Title": "Buffalo Games Recalls Chuckle & Roar Ultimate Water Beads Activity Kits Due to Serious Ingestion, Choking and Obstruction Hazards; One Infant Death Reported; Sold Exclusively at Target",
    "Date": "9/14/2023",
    "Summary": "This recall involves the Chuckle & Roar Ultimate Water Beads Activity Kit. On the front of the purple container, the label states Ultimate Water Beads Activity Kit. It includes: 2 ounces of \"jumbo\" water beads and 6 ounces of \"regular\" water beads. Along with a clear container and lid, there are five small toy fish, a scissor scoop, tweezers, a scoop with a handle, 10 activity cards and instructions. The activity kit was sold in a purple box with UPC Number 079346627035 on the back.",
    "Repair Number": 23286
  },
  {
    "Title": "American Honda Motor Recalls Lawnmowers and Pressure Washer Engines Due to Injury Hazard",
    "Date": "9/14/2023",
    "Summary": "This recall involves Honda HRN216 and HRX217K6 lawnmowers and the GCV170/200 G5B pressure washer engines. The gas-fueled walk-behind lawn mowers are red and black with \"HONDA\" written on the clipping collection bag. The model and serial number are printed on a label located on the upper rear of the mower deck. The pressure washer engines are mounted on various original equipment manufacturer frames. The serial number of the engine is engraved on a flat spot on the engine.",
    "Repair Number": 23287
  },
  {
    "Title": "Generac Recalls Portable Generators Due to Serious Fire and Burn Hazards",
    "Date": "9/14/2023",
    "Summary": "This recall involves Generac Portable Generators type GP15000E, with model numbers G0057341, G0057342, 005734R1, and 005734R2, and type GP17500E, with model numbers G0057351, G0057352, 005735R1, and 005735R2. \"Generac\" and the unit type are printed on both sides of the tank and on the control panel of the generators. The model number is printed on a label on the heat shield between the engine and alternator of the generator. Consumers can also visit https://www.generac.com/about-us/product-recall-notifications/GP15000-GP17500-recall to see if their specific unit type and model number are included in this recall. Unit type and model numbers include: Unit Type Model Numbers GP15000E G0057341 G0057342 005734R1 005734R2 GP17500E G0057351 G0057352 005735R1 005735R2",
    "Repair Number": 23288
  },
  {
    "Title": "Best Buy Recalls Insignia and Yardbird Fire Tables with Lava Rocks Due to Burn and Impact Injury Hazards (Recall Alert)",
    "Date": "9/14/2023",
    "Summary": "This recall involves the Insignia and Yardbird fire tables sold with lava rocks. The Insignia fire tables include a cabinet housing the propane tank, a square table surface and a recessed center inset housing the heating element and lava rock fill material. The fire tables have a black finish. The model number is printed on a rating label on the inside of the cabinet door. Model NS-PFT28BK3 (28-inch model) measures about 28 inches long by 28 inches wide. Model NS-PFT30BK03 (30-inch model) measures about 30 inches long by 30 inches wide. The recalled Yardbird fire tables were sold ready-to-assemble with a square top with twelve inset tiles and resin wicker on the sides. The tables include a hinged cabinet housing the propane tank, a recessed center for housing the heating element and a cover for the center opening. The Yardbird fire tables measure about 43 inches long by 43 inches wide and were sold under manufacturer model number MPN70639. Only Insignia and Yardbird fire tables with lava rock fill are included in this recall.",
    "Repair Number": 23792
  },
  {
    "Title": "Emporia Recalls North America Smart Plugs Due to Electric Shock Hazard",
    "Date": "9/7/2023",
    "Summary": "This recall involves Emporia's North America Smart Plugs. The smart plugs have a white finish exterior. Emporia is printed on the front. The plugs allow consumers to monitor the energy use and control most home appliances with the Emporia App, including fans, lamps, humidifiers, and other electronics from a smartphone. This recall only affects the 120V North American plugs, the 240V EU. They measure approximately 3-1/2 inches wide, 1-1/2 inches high, and 1 inch deep. The smart plugs were sold individually or in multi-packs.",
    "Repair Number": 23274
  },
  {
    "Title": "Engineered Controls International Recalls LP Gas Compact Regulators Due to Fire Hazard",
    "Date": "9/7/2023",
    "Summary": "This recall involves the RegO 302 Series Compact Regulators with dates codes between 09/22 and 02/23. Regulators with the date code 21/22 are also included in this recall. The date codes are stamped on the back of the metal regulators. The regulators are designed for liquefied petroleum gas (i.e., propane) tanks for outdoor grills, heaters and fireplaces.",
    "Repair Number": 23275
  },
  {
    "Title": "Pirelli Tire Recalls P ZERO Race TLR Bicycle Tires Due to Fall Hazard",
    "Date": "9/7/2023",
    "Summary": "This recall involves certain Pirelli P ZERO Race TLR bicycle tires in the size 28-622. The tires are black and have either yellow, white, red, or gold branding on the sidewalls. The model name, model number, tire ID and production date code can all be found on the sidewalls. Model Name Model Number Tire ID Production Date Code 28-622 P ZERO TM Race TLR Classic 3984300 843L All date codes between \"1023\" to \"2423\" 28-622 P ZERO TM Race TLR 4149600 496N All date codes between \"1023\" to \"2423\" 28-622 P ZERO TM Race TLR Yellow 4204400 044P All date codes between \"1023\" to \"2423\" 28-622 P ZERO TM Race TLR White 4204500 045P All date codes between \"1023\" to \"2423\" 28-622 P ZERO TM Race TLR Red 4204600 046P All date codes between \"1023\" to \"2423\" 28-622 P ZERO TM Race TLR Gold 4416600 166T All date codes between \"1023\" to \"2423",
    "Repair Number": 23276
  },
  {
    "Title": "Lectric Ebikes Recalls Disc Brake Calipers Sold on Lectric E-Bicycles Due to Crash and Injury Hazards (Recall Alert)",
    "Date": "9/7/2023",
    "Summary": "This recall involves mechanical disc brake calipers located on both front and rear of Lectric electric bicycle models XP 3.0 Black, XP 3.0 Long- Range Black, XP Step-Thru 3.0 Black, XP Step-Thru 3.0 White, XP Step-Thru 3.0 Long Range, XP Step-Thru 3.0 Long Range White. The model name is printed on the bike's rear rack.",
    "Repair Number": 23789
  },
  {
    "Title": "ARGO Recalls ARGO Xplorer All-Terrain Vehicles (ATVs) Due to Fire Hazard (Recall Alert)",
    "Date": "9/7/2023",
    "Summary": "This recall involves ARGO Xplorer XR 500 and XRT 500 ATVs in model years 2020 through 2021 and XR 570, and XRT 570 ATVs in model years 2021 through 2023. The vehicles were sold in green, red, white, black, blue and graphite colors. Consumers can identify their ATV by looking at the VIN plate, which is located in the right-front wheel well on the frame of the vehicle. Consumers can identify the year of their ATV with the following code: the 10th character in the VIN will be L for model year 2020, M for model year 2021, N for model year 2022, and P for model year 2023. The model name and package is located on the side decals of the ATV. Model Name Model Year XPLORER XR 500 2020, 2021 XPLORER XR 500 LE 2020, 2021 XPLORER XR 570 2021, 2022 XPLORER XR 570 LE 2021, 2022 XPLORER XRT 500 2020, 2021 XPLORER XRT 570 2021, 2022, 2023 XPLORER XRT 570 LE 2022, 2023",
    "Repair Number": 23790
  },
  {
    "Title": "Whirlpool Recalls Stacked Commercial Clothes Dryers Sold Under the ADC Brand Due to Fire Hazard (Recall Alert)",
    "Date": "9/7/2023",
    "Summary": "This recall involves all ADC brand stacked commercial clothes dryers with a 30 lb. capacity and model number ADG-30X2R or ADG-30X2Ri. Both models were sold in on-premise and coin-operated configurations for multi-unit housing, laundromats, and other facilities that use commercial laundry equipment. Logos and branding may appear differently depending on when the unit was manufactured. The model number for each unit is printed inside near the hinges of the upper door. The ADG-30X2R units were also sold in custom colors other than white to fit location branding.",
    "Repair Number": 23791
  },
  {
    "Title": "Electrolux Group Recalls Frigidaire Gas Cooktops Due to Risk of Gas Leak, Fire Hazard",
    "Date": "8/31/2023",
    "Summary": "This recall involves all Frigidaire Stainless-Steel 30-inch 4 Burner Gas Cooktops (model FFGC3026SS) and Frigidaire Stainless-Steel 36-inch 5 Burner Gas Cooktops (model FFGC3626SS) with control knobs with black shafts. The model number and serial number are located on a label on the underside of the unit. The cooktops have \"FRIGIDAIRE\" on the front, lower left corner. The following serial numbers are included in this recall: Model Numbers Serial Numbers FFGC3026SS 1F00590006 through 1F11090155 3F53705075 through 3F01309052 FFGC3626SS 1F00590020 through 1F10390342 3F53703455 through 3F00806110 To determine whether their cooktop is included in the recall, consumers should visit www.cooktopknobrecall.com and input the model and serial number.",
    "Repair Number": 23269
  },
  {
    "Title": "Apollo Recalls Phantom Electric Scooters Due to Fall and Injury Hazards",
    "Date": "8/31/2023",
    "Summary": "This recall involves the Apollo Phantom V1, V2 and 60V Electric Scooters models. The scooter has one stem bolt that connects the stem of the scooter with the front suspension and wheel assembly. \"Apollo\" is printed on the stem of the scooter and \"Apollo Phantom\" is displayed on the rear left side of the grip tape on the deck of the scooter. \"Apollo Phantom\" is also listed on the bottom of the scooter with the model year.",
    "Repair Number": 23270
  },
  {
    "Title": "Prime-Line Recalls Glass Doorknobs Due to Laceration Hazard",
    "Date": "8/31/2023",
    "Summary": "This recall involves Prime-Line glass doorknobs sold under the Defender Security, Gate-House and Reliabilt brand names. The doorknobs all utilize fluted glass knobs and were sold in bronze, brass, satin nickel, matte black and chrome finishes. The following model numbers are included in this recall: E 2279; E 2279-L; E 2311; E 2317; E 2328; E 2496; E 2497; E 2536; E 2536-L; E 2537; E 2537-L, E 2750, and E 2797. The model number is printed on the top right side of the packaging.",
    "Repair Number": 23271
  },
  {
    "Title": "TOMY Recalls Boon Flair and Flair Elite Highchairs Due to Fall Hazard",
    "Date": "8/31/2023",
    "Summary": "This recall involves Boon Flair highchairs manufactured before September 2016, and all Boon Flair Elite highchairs. The recalled Flair Elite highchair has a white and orange molded plastic seat with a white tray and metal pedestal base. The Flair highchairs have a gray plastic pedestal base and were sold in 10 color combinations, including blue/white, white/orange, pink/white, green/white, gray/green, white, gray, white/gray, white/blue and red/white. The model numbers of the recalled highchairs are listed below. The model number and manufacturing date code are printed on a label located under the base of the highchair. Flair Elite Highchair Model No. Description B751 White / Orange Flair Highchair Model No. Description B701 Blue / White B702 White / Orange B703 Pink / White B704 Green / White B706 White / Orange B707 White / Blue B708 Red / White B709 Red / White B716 Green / White B717 White / Orange B718 White / Blue B731 White / Orange B10147 Gray / Green B11068 White / No Pad B11069 Gray / No Pad B11401 White / Gray",
    "Repair Number": 23272
  },
  {
    "Title": "Bombardier Recreational Products (BRP) Recalls Ski-Doo and Lynx Snowmobiles Due to Fire Hazard (Recall Alert)",
    "Date": "8/31/2023",
    "Summary": "This recall involves all model year 2023 Ski-Doo Freeride and Summit model snowmobiles equipped with an 850E-TEC Turbo R Engine and all Lynx Shredder model snowmobiles equipped with an 850 E-TEC Turbo R Engine. The vehicles were sold in a variety of colors. \"Ski-Doo\" is printed on a decal on the right-hand side of the snowmobiles. A vehicle decal is printed on the side of the snowmobiles that includes the model name. Only snowmobiles with the following years and model numbers are included in the recall: Model Year Model Name 2023 Ski-Doo Freeride 850 E-TEC Turbo R 2022 Ski-Doo Summit 850 E-TEC Turbo R 2023 Lynx Shredder 850 E-TEC Turbo R",
    "Repair Number": 23786
  },
  {
    "Title": "Chemboys Recalls DIYChemicals Potassium and Sodium Hydroxide Products Due to Failure to Meet Child-Resistant Packaging Requirement and Violation of FHSA Labeling Requirement (Recall Alert)",
    "Date": "8/31/2023",
    "Summary": "This recall involves Chemboys LLC's DIYChemicals potassium hydroxide and sodium hydroxide products. These products are commonly used for soapmaking and cleaning. The sodium hydroxide, also called lye or caustic soda, and the potassium hydroxide products were sold in a heat-sealed or resealable bag available from 200 gram to 10-pound sizes. \"DIYChemicals\" is printed on the front of the product packaging.",
    "Repair Number": 23787
  },
  {
    "Title": "Polaris Recalls MATRYX PRO RMK and MATRYX RMK KHAOS Snowmobiles Due to Serious Injury Hazard (Recall Alert)",
    "Date": "8/31/2023",
    "Summary": "This recall involves Polaris Model Year 2022-2023 MATRYX PRO RMK and MATRYX RMK KHAOS snowmobiles. The recalled snowmobiles were sold in black and custom color combinations. \"POLARIS\" or \"KHAOS\" is stamped on the front side paneling of the vehicles. The VIN and Model Number are located on the right side of vehicle's frame. Consumers can enter their VIN at www.polaris.com/en-us/off-road-recalls/ to see if their snowmobile is included in any recalls.",
    "Repair Number": 23788
  },
  {
    "Title": "Multi-Purpose Kids Bike Helmets Recalled Due to Risk of Head Injury, Failure to Meet Bicycle Helmet Standard Requirements; Sold by Ecnup Exclusively on Amazon.com (Recall Alert)",
    "Date": "8/24/2023",
    "Summary": "This recall involves Ecnup Kids Bike Helmets in size Extra Small (XS), fitting a head circumference of about 18-1/2 to 20-1/2 inches. The helmets are pink, purple, blue, \"dinosaur blue\" or \"aqua ocean world\" with red removable padding, black straps and a black buckle. The serial number SL712-202201 and November 2022 are printed on a white label on the inside of the helmet.",
    "Repair Number": 23785
  },
  {
    "Title": "Aiper Elite Pro Cordless Robotic Pool Vacuum Cleaners Recalled Due to Burn and Fire Hazards; Distributed by Shenzhen Aiper Intelligent Co. (Recall Alert)",
    "Date": "8/24/2023",
    "Summary": "This recall involves Aiper Elite Pro cordless robotic pool vacuum cleaners with model number GS100. The Elite Pro unit weighs 11.2 pounds and measures about 15.9 x 14.2 x 10 inches. The dark gray pool vacuum cleaners have the \"Aiper\" brand name printed on the top/front of the product. The model name and number are printed on the label attached on the bottom side of the pool vacuum.",
    "Repair Number": 23784
  }
]